[
    {
        "title": "Regina King in Schiaparelli at the NYC Premiere of 'Caught Stealing'. (August 26, 2025)",
        "content": "",
        "author": "cmaia1503",
        "score": 135,
        "url": "https://www.reddit.com/gallery/1n11j3y",
        "created_utc": 1756251377.0,
        "comments": [
            {
                "body": "Please keep your comments fashion focused.\n\nNo body shaming/commentary on appearance/weight/cosmetic enhancement/lifestyles, etc.\n\nRule breakers will be banned without warning.\n\n➡️ Thanks to our loyal frockkers for keeping our community safe by reporting those who abuse the rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatthefrockk) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Gorgeous. I’m dying over that color in velvet.",
                "author": "pameliaA",
                "score": 16
            },
            {
                "body": "Jump scare in pic 13. Why is her head gigantic? \n\nAnyway love this. That braid is amazing. I wish we got more side shots so we could see it with the whole outfit.",
                "author": "nodogsallowed23",
                "score": 8
            },
            {
                "body": "She looks so lovely. I hope she’s doing well mentally and emotionally.",
                "author": "hbicuche",
                "score": 5
            },
            {
                "body": "So beautiful. I'm a sucker for velvet in dark colours, and she looks amazing.",
                "author": "strawberryskullskill",
                "score": 3
            },
            {
                "body": "That braid!!!   The jewelry!!",
                "author": "iliketreesandbeaches",
                "score": 3
            },
            {
                "body": "I love the velvet!!!",
                "author": "Mean_Contract",
                "score": 1
            },
            {
                "body": "That dark velvet is a dream on her, and I love the gold accessories.",
                "author": "pumpkinspruce",
                "score": 1
            },
            {
                "body": "I love the dress and I love how she accessorised her hair\n\n![gif](giphy|QAJGv5Y9XOjS8OOrtd|downsized)",
                "author": "Elephant12321",
                "score": 1
            },
            {
                "body": "She is an amazing actress and woman.  I’ve been watching her since she was a child on 227.  And this color and gown are so luxurious! Definitely a winner.",
                "author": "bitchwhohasnoname",
                "score": 1
            },
            {
                "body": "I know my first thought was how gorgeous the color is on her",
                "author": "Paolito14",
                "score": 3
            },
            {
                "body": ">Jump scare in pic 13\n\nRight?!? I said WTF out loud. Like a YouTube thumbnail.",
                "author": "pannonica",
                "score": 2
            }
        ]
    },
    {
        "title": "New ‘Harry Potter’ Child Actors Should Stay Off Social Media and Keep Living at Home, Warns Sophie Turner: Being Online ‘Almost Destroyed Me’ as a Teen Star",
        "content": ">“Social media was just really becoming a big thing after I started on ‘Game of Thrones,’ so I got a couple of years of peace and quiet and then I had to adjust. It had such a profound impact on my mental health, like more than I could tell you. It almost destroyed me on numerous occasions.” said Turner, who was only 13 years old when she debuted as Sansa Stark on “Game of Thrones.”\n\n\n\n>“I look at the kids who are about to be in the new ‘Harry Potter’ and I just want to give them a hug and say, ‘Look, it’s going to be okay but don’t go anywhere near \\[social media\\],’” Turner added. “‘Stay friends with your home friends, keep living at home with your family, make sure your parents are your chaperones’ — it’s so important to have that grounding adjacent to the big, crazy stuff that you do.”",
        "author": "cmaia1503",
        "score": 854,
        "url": "https://variety.com/2025/tv/news/harry-potter-child-actors-social-media-sophie-turner-1236497688/",
        "created_utc": 1756249737.0,
        "comments": [
            {
                "body": "She's not wrong, especially as a woman having the whole world talk shit about your looks seems impossibly difficult.",
                "author": "MagnetoWasRight24",
                "score": 237
            },
            {
                "body": "I feel like it’s almost selfish to force this level of visibility on a bunch of kids",
                "author": "armadillo1296",
                "score": 587
            },
            {
                "body": "I hate JKR for her awful transphobia but I do worry these children will face social media harassment over it. Kids can't really make informed choices for themselves like the adults in the series can. I hope anyone who criticizes those taking part in the new series can recognize that and focus on the spineless adults and bigoted creator than these kids.",
                "author": "CutieBoBootie",
                "score": 180
            },
            {
                "body": "I hope the kids do zero promotion. Maybe they attend the premiere with their parents! But they don't need to do talk shows, photo shoots, or interviews. Let the grown ups involved do the promotional work and let the kids just have fun in the bubble of making the thing and then let them go home!",
                "author": "violetmemphisblue",
                "score": 50
            },
            {
                "body": "See: Bella Ramsay. She's been treated so awfully online for the crime of... not looking like a character that doesn't exist.",
                "author": "Tumblrrito",
                "score": 25
            },
            {
                "body": "Many years ago I lived near a pretty well known director and his famous (not in the US) wife. I was talking to them one evening and he had cast some unknown girl in a pretty minor film he was directing and his wife just deadpanned, “Well, another life ruined.” And I’ve never forgotten that.",
                "author": "NeiClaw",
                "score": 33
            },
            {
                "body": "Why are we giving She Who Deserves No Name ***more*** money???",
                "author": "mindsunwound",
                "score": 107
            },
            {
                "body": "As much as I hate that this project is happening, those kids don't deserve any negativity or hatred. They're *literal, actual children.* I hope they grow up relatively normal and happy.",
                "author": "gorgon_heart",
                "score": 14
            },
            {
                "body": "Let’s take it a step further: parents, don’t let your kids on social media. Ever. It’s poison.",
                "author": "RiverHarris",
                "score": 9
            },
            {
                "body": "These kids are going to need a lot of protection and therapy. Emma Watson’s father also came out and said something similar.\n\nI’m already seeing people complain about the Ron actor’s height (he’s supposed to be talll and lanky) but so far the sweet kid isn’t that tall. God forbid he doesn’t hit those insane marks during puberty—some fans are going to lose their minds if Ron is short.",
                "author": "oatmlklattes",
                "score": 10
            },
            {
                "body": "Honestly, probably just good advice for any child. The internet is a terrible place and they’re better off without it for as long as possible.",
                "author": "readytogohomenow",
                "score": 7
            },
            {
                "body": "That is great advice for any upcoming child stars and I truly hope the new Harry Potter series bombs!",
                "author": "Comfortable-Load-904",
                "score": 31
            },
            {
                "body": "Despite my growing out of ‘Potter’ I worry about the well being of these kids.",
                "author": "rubendurango",
                "score": 7
            },
            {
                "body": "You know who else should stay off social media?\n\n![gif](giphy|xUOwGea1Oh5OzAPfag|downsized)",
                "author": "ChinaCatProphet",
                "score": 8
            },
            {
                "body": "We should all stay off social media because it's destroying us.",
                "author": "TheAncientMillenial",
                "score": 4
            },
            {
                "body": "I really hope their parents are good and not trying to just use them as cash cows. I hope they stay readily available for their children at all times and keep an eye on them. It makes me so nervous for child actors :(",
                "author": "dragonfly931",
                "score": 3
            },
            {
                "body": ">make sure your parents are your chaperones\n\nI mean, maybe Sophie's parents were grand, but half the time the parents are the ones selling them. I wish there was more protection for child actors in general, and I think part of that is making sure the parents aren't always the ones making decisions for them.",
                "author": "RaggySparra",
                "score": 3
            },
            {
                "body": "I feel for these kids. They have been thrust into a show that they should be proud of, if it weren't for the fact that JK is a monster. But I don't know if they're even old enough to understand what is happening with her. But they're like the face of this show! I just hope that people are not harassing them.",
                "author": "joodee3",
                "score": 2
            },
            {
                "body": "It makes sense to me based on her current age, but I had no idea she started so young on game of thrones. I didn't watch it though",
                "author": "MsThrilliams",
                "score": 2
            },
            {
                "body": "The kids are so cute :( And Game of Thrones wasn't anywhere close to as controversial as this is going to be, I feel so bad for these kids and I hope they're protected through all this because it is not going to be easy. Shame on the adults involved in making this a thing and subjecting these kids to this",
                "author": "chhhhhhhhhhh95",
                "score": 1
            },
            {
                "body": "Especially as these kids are invariably going to be attacked and blamed for the choices (and in some cases the rhetoric) made by adults.",
                "author": "insertbrackets",
                "score": 1
            },
            {
                "body": "Excellent advice. These kids are too young to deal with the kind of backlash they're sure to face.",
                "author": "punkmolloy",
                "score": 1
            },
            {
                "body": "I wonder if these kids have any idea what they stand for, who they are making money for and what they will represent.",
                "author": "emccm",
                "score": 1
            },
            {
                "body": "Talk shit, or fantasize about while she was a literal child. \n\n\nThese babies are going to have fetish fanart made of them someday. People are sick.",
                "author": "tgrdem",
                "score": 58
            },
            {
                "body": "This whole remake is selfish. Just a money maker for you-know-who.",
                "author": "catsandalpacas",
                "score": 410
            },
            {
                "body": "I also feel bad for them that once they're old enough they'll have to start fielding questions about JK Rowling tbh. I judge any adults that choose to participate in the franchise now, but these kids are like 10 so they don't know any better.",
                "author": "UnnaturalSelection13",
                "score": 30
            },
            {
                "body": "Honestly they shoulda done a cartoon - this day and age they know a child actor coming out okay is hard -the odds aren’t in their favor",
                "author": "Ok-Turnip-9035",
                "score": 3
            },
            {
                "body": "I know this is an insane and highly unprofitable idea, but making movies with children shouldn’t be released till they are 18. Would prevent a lot of weirdness.",
                "author": "Wonderful_Gap1374",
                "score": 5
            },
            {
                "body": "Anyone who harasses a child over the actions of an adult is a clown. Those kids didn’t have anything to do with JKR’s nasty views.",
                "author": "KimJongFunk",
                "score": 89
            },
            {
                "body": "Every trans person I follow has said the kids aren’t at fault and shouldn’t face criticism or harassment",
                "author": "No_Eggplant_7040",
                "score": 30
            },
            {
                "body": "I have no opinion on the children.\n\nEvery adult involved is a piece of shit sellout. And that includes the parents of these children.",
                "author": "HerRoyalRedness",
                "score": 26
            },
            {
                "body": "I definitely don't think the kids deserve the harassment that's likely to stem from this, these roles are going to be HUGE for them.   \nHowever, definitely side-eyeing the established adult actors who've decided to tie themselves to this, they have no excuses",
                "author": "Fiigwort",
                "score": 6
            },
            {
                "body": "Pretty sure most of the harassing is coming from over-invested #notmypotter types, not people who have disavowed the series because of Joanne's bigotry.",
                "author": "sundayontheluna",
                "score": 3
            },
            {
                "body": "If not now, they'll eventually find out.",
                "author": "nova_crystallis",
                "score": 1
            },
            {
                "body": "Yeah in Sophie’s case it was less “talking shit” and more “creeps counting down to her 18th birthday,” though I do know that she had adults telling her how much they hated her and what a bitch she when she was 14 years old.",
                "author": "thewomaninthemoon",
                "score": 38
            },
            {
                "body": "Voldy would be sad to know he's not the only *you-know-who* anymore.",
                "author": "JunRoyMcAvoy",
                "score": 96
            },
            {
                "body": "And Warner Bros’ c-suite being obsessed with “”marketable IPs”” to the detriment of the industry.",
                "author": "rubendurango",
                "score": 23
            },
            {
                "body": "She who shall not be named???!",
                "author": "meme_anthropologist",
                "score": 11
            },
            {
                "body": "The funniest theory is that she's remaking the series because all three of the original leads want nothing to do with her and her views and she got so pissed she's demanding a remake.",
                "author": "Lord_of_Knitting",
                "score": 9
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": 4
            },
            {
                "body": "I think they should have to justify any project with kids in it. Like, can this story be told without a kid? If yes, then there is no kid. If not, then does the kid necessarily need to be young, or could they be a teenager? If they could be a teenager, then do that. If they need to be young for the story to work, question if this **needs** to be made--what about this project is so important that a seven year old should be working?\n\n\nAnd anytime there are kids working, they should only be on set for their scenes. They shouldn't have to do anything surrounding the promotion or anything like that. It's just pretending and then going home. With the set having a therapist or psychologist on set at all times, kids not participating in adult content, and there being other kids to play with. And as soon as a kid says no to filming, they stop. These things should have the budget to support that.\n\n\nI know it would never happen, but reading and seeing documentaries about child stars throughout the decades has made me convinced it is rare that kids need to be on screen. Everyone involved needs to take a good look at what they're willing to exchange for someone's childhood.",
                "author": "violetmemphisblue",
                "score": 1
            },
            {
                "body": "Well I haven't seen it happen but I do know that some people LOVE to just be evil and hurtful for no reason, but if there is a reason then they will partake gleefully just as much. Any normal person with a brain isn't likely to harass these kids but sadly I've been online too long to think it wouldn't happen at all. ",
                "author": "CutieBoBootie",
                "score": 8
            },
            {
                "body": "They are clowns for sure but sadly they exist by the thousands.",
                "author": "eugeneugene",
                "score": 5
            },
            {
                "body": "Yeah I'm non binary and none of my trans friends would ever do something heinous like that but.... I remember Twitter was fucking wild even before musk. Like I said in another comment some people will use any excuse to be awful on the internet and its not because they actually care about anything.",
                "author": "CutieBoBootie",
                "score": 14
            },
            {
                "body": "Yep, I'm trans and have disavowed JKR and this franchise, but the kids have no fault in this. Their parents deserve criticism though (not harassment).",
                "author": "punkmolloy",
                "score": 10
            },
            {
                "body": "And not the worst.",
                "author": "asietsocom",
                "score": 26
            },
            {
                "body": "Or still say He to really piss JKR off lol",
                "author": "therequiembellishere",
                "score": 8
            },
            {
                "body": "Moldemort",
                "author": "asietsocom",
                "score": 3
            },
            {
                "body": "Same. Not to say people won't pretend to be trans just stir shit up. 😑",
                "author": "baconbits2004",
                "score": 3
            },
            {
                "body": "JKR has accomplished something I doubt any other author has: become more hated than the supervillain in the stories. You go, girl?",
                "author": "catsandalpacas",
                "score": 31
            },
            {
                "body": "Oh, for sure.",
                "author": "punkmolloy",
                "score": 2
            },
            {
                "body": "Is there any male author that's hated by their former fans as much as JKR is? This is feminism in action.",
                "author": "asietsocom",
                "score": 8
            },
            {
                "body": "Orson Scott Card maybe? He had a similar flip to conservatism when the Trump years started. His hard-line stance against gay rights has definitely turned off a lot of his forever fans.",
                "author": "Bi_disaster_ohno",
                "score": 3
            },
            {
                "body": "Neil Gaiman.",
                "author": "Madame-Trash-Heap",
                "score": 3
            },
            {
                "body": "Neil Gaiman",
                "author": "nekocorner",
                "score": 3
            },
            {
                "body": "Card has been a homophobe for much longer than that - since the 90s - & conservative since before Trump, as well.",
                "author": "nekocorner",
                "score": 2
            },
            {
                "body": "Never heard of him. JKR is still leading the charge of turning into human shit",
                "author": "asietsocom",
                "score": 1
            },
            {
                "body": "„hard-line stance against gay rights“\n\nWell, he’s a Mormon, so that checks out…",
                "author": "Aikea_Guinea83",
                "score": 1
            },
            {
                "body": "Ah I stand corrected, thank you. I knew he was MAGA but I didn't know how far back it went.",
                "author": "Bi_disaster_ohno",
                "score": 1
            },
            {
                "body": "Author of Enders Game, not surprising you haven't heard of him his hay day was decades ago at this point. Still, if you want an example of a male author that used to be beloved until he turned off his fan base with his crazy bigotry he'd fit the bill.",
                "author": "Bi_disaster_ohno",
                "score": 1
            }
        ]
    },
    {
        "title": "The official trailer for ‘Alice in Borderland’ Season 3 has been released.",
        "content": "",
        "author": "cmaia1503",
        "score": 73,
        "url": "https://v.redd.it/sjgr8ekajflf1",
        "created_utc": 1756242735.0,
        "comments": [
            {
                "body": "I thought season 2 was perfect ending but this looks pretty good tbh",
                "author": "Sudden_Pop_2279",
                "score": 18
            },
            {
                "body": "I thought they’d cancelled this show! Thank you OP, I’m so happy!",
                "author": "DangerousLack",
                "score": 11
            },
            {
                "body": "Mark my words Banda will be more evil than Niragi",
                "author": "Sudden_Pop_2279",
                "score": 8
            },
            {
                "body": "Original content? Didn't watch season 2, but people told me it ended where the manga ended, so there shouldn't be anything more to do live action.",
                "author": "AppleNHK",
                "score": 5
            },
            {
                "body": "OMFG I DIDNT KNOW THERE WOULD BE A THIRD SEASON.",
                "author": "Khmakh",
                "score": 3
            },
            {
                "body": "Did I miss them in the trailer or are Chisiya & Kuina not in it???",
                "author": "Internal-Duck-2716",
                "score": 2
            },
            {
                "body": "Loved both seasons. Was confused as hell by the ending. Still does not understand what it meant. And it’s been so long since season 2. They really making it hard Netflix...",
                "author": "Morg075",
                "score": 2
            },
            {
                "body": "I couldn't get into this show after Squid Game came along and subverted the entire genre. Both shows came out around the the same time and I couldn't help but compare the two. it made me realize that Alice in Borderland has every death game trope and cliche present in it's storytelling.",
                "author": "mason202",
                "score": -3
            },
            {
                "body": "Oh absolutely.",
                "author": "Suspicious-Owl2544",
                "score": 1
            },
            {
                "body": "There’s actually a part where he goes back in.\n\nI forget the name of the “sequel” manga but it is very short and interesting.",
                "author": "DisastrousReputation",
                "score": 1
            },
            {
                "body": "It was a thing before squid game. I read the manga years ago. Came out 15 years ago.",
                "author": "DisastrousReputation",
                "score": 1
            },
            {
                "body": "Oh I thought that was already adapted, I did read the manga, but I don't know how they'll make it a full season, it was really short. I guess they will add more games and characters",
                "author": "AppleNHK",
                "score": 1
            }
        ]
    },
    {
        "title": "Robert Irwin recently visited his dad’s Star on the Hollywood Walk of Fame.",
        "content": "",
        "author": "cmaia1503",
        "score": 687,
        "url": "https://v.redd.it/qhnc447trelf1",
        "created_utc": 1756233483.0,
        "comments": [
            {
                "body": "&nbsp;\n\n&nbsp;\n&nbsp;✨🍯 **[JOIN THE FAUXHIVE](https://www.reddit.com/r/Fauxmoi/)** \n&nbsp;\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐝 **[APPLY TO BEE A MOD](https://forms.gle/q6pahnN4SbJTfatL9)**    \n                       \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🌺 **[MAKE REDDIT PINK AGAIN](https://www.reddit.com/r/Fauxmoi/wiki/index/pink/)**    \n            \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐦‍🔥 **[JOIN OUR FIRESIDE CHATS](https://www.reddit.com/r/Fauxmoi/?f=flair_name%3A%22FREE-FOR-ALL%22)**\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n☘️ **[ENTER OUR POP CULTURE BINGO](https://www.reddit.com/r/Fauxmoi/comments/1h62mch/2025_pop_culture_predictions_bingo)**      \n&nbsp;",
                "author": "rfauxmoi",
                "score": 1
            },
            {
                "body": "![gif](giphy|fEhUasXOQAuc0|downsized)\n\nStill missed 💜",
                "author": "YohanWinchester",
                "score": 96
            },
            {
                "body": "Steve Irwin was so inspirational to so many people. I hope his son continues",
                "author": "nicktbristol2020",
                "score": 65
            },
            {
                "body": "It’s crazy to me that Steve Irwin died almost 20yrs ago. He was such an important figure of my childhood. Still miss him.",
                "author": "Timelordvictorious1",
                "score": 47
            },
            {
                "body": "He’s a cutie!",
                "author": "squishmallow2399",
                "score": 24
            },
            {
                "body": "He seems like a good egg. I hope I'm right about this! Steve's enthusiasm and care for wildlife was really impactful and it's nice to see Robert pursuing the same kind of work. ",
                "author": "GranadaTostada",
                "score": 20
            },
            {
                "body": "Keep up your work of following in his footsteps, Robert. He'd be so bloody happy and proud of you (and Bindi ofc!) ❤️",
                "author": "MandaRenegade",
                "score": 19
            },
            {
                "body": "Bro it's like my allergies are really bad today or something... why am I tearing up",
                "author": "navy_sweatshirt",
                "score": 16
            },
            {
                "body": "Seems like the nicest chap! 🥰",
                "author": "Cooperwalk",
                "score": 8
            },
            {
                "body": "I could listen to him talk ALL DAY.",
                "author": "Odd_Policy_3009",
                "score": 7
            },
            {
                "body": "i still remember the morning the news hit that Steve died. everyone was discussing it at school and we were all upset \n\nand i still have beef with stingrays to this day. which as someone who grew up in a coastal area and has pet many a stingray...sad. but its on sight still",
                "author": "Chaoticgood790",
                "score": 1
            },
            {
                "body": "He’s trying",
                "author": "Cafe_racerr",
                "score": 25
            },
            {
                "body": "Robert was so young... a toddler (2 I think) when his dad died 😥",
                "author": "lyn73",
                "score": 16
            }
        ]
    },
    {
        "title": "The official teaser trailer for Chloé Zhao’s ‘Hamnet’ has been released. Starring Jessie Buckley, Paul Mescal, Joe Alwyn & Emily Watson.",
        "content": "",
        "author": "cmaia1503",
        "score": 278,
        "url": "https://v.redd.it/zxcepttqrdlf1",
        "created_utc": 1756221357.0,
        "comments": [
            {
                "body": "&nbsp;\n\n&nbsp;\n&nbsp;✨🍯 **[JOIN THE FAUXHIVE](https://www.reddit.com/r/Fauxmoi/)** \n&nbsp;\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐝 **[APPLY TO BEE A MOD](https://forms.gle/q6pahnN4SbJTfatL9)**    \n                       \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🌺 **[MAKE REDDIT PINK AGAIN](https://www.reddit.com/r/Fauxmoi/wiki/index/pink/)**    \n            \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐦‍🔥 **[JOIN OUR FIRESIDE CHATS](https://www.reddit.com/r/Fauxmoi/?f=flair_name%3A%22FREE-FOR-ALL%22)**\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n☘️ **[ENTER OUR POP CULTURE BINGO](https://www.reddit.com/r/Fauxmoi/comments/1h62mch/2025_pop_culture_predictions_bingo)**      \n&nbsp;",
                "author": "rfauxmoi",
                "score": 1
            },
            {
                "body": "paul mescal 🤝 dakota johnson \n\nnever changing their hair for a movie",
                "author": "knickstapeeee",
                "score": 217
            },
            {
                "body": "just checked out the book from the library!",
                "author": "Upset_Honeydew5404",
                "score": 34
            },
            {
                "body": "I have this book and am enjoying it!!!! Love detailed psychological historical fiction",
                "author": "armadillo1296",
                "score": 18
            },
            {
                "body": "I've heard that the screen test didn’t go as planned and that it was made inelligible for Venice. Is it true or just a rumour ?",
                "author": "XX_bot77",
                "score": 40
            },
            {
                "body": "This looks beautifully heartbreaking.",
                "author": "Due-Secret-3091",
                "score": 12
            },
            {
                "body": "I just do not get the appeal of Paul Mescal. They’re trying to make him seem like the next Daniel Day Louis and I’m just not there.",
                "author": "hockeypuckburger",
                "score": 24
            },
            {
                "body": "I am absolutely seated for this",
                "author": "carbonpeach",
                "score": 7
            },
            {
                "body": "I am going to be devastated by this movie 😭 I cried so hard at the book",
                "author": "Jennycatclub",
                "score": 5
            },
            {
                "body": "Feels a bit like Spielberg giving the finger to Harvey Weinstein and the bullshit he pulled to manipulate voters to give Best Picture for Shakespeare In Love from Saving Private Love. Spielberg refused to do any negative or counteractive press at the time because Goop is his goddaughter.",
                "author": "ReduceReuseReuse",
                "score": 2
            },
            {
                "body": "Jessie Buckley is amazing",
                "author": "bkander2",
                "score": 2
            },
            {
                "body": "And I'll be there day one",
                "author": "yourwinemom",
                "score": 5
            },
            {
                "body": "Are they married to that title?",
                "author": "TedKoppelz",
                "score": -27
            },
            {
                "body": "Maggie O’Farrell is overrated, but this cast list has me somewhat seated. ",
                "author": "Time-Environment5661",
                "score": -21
            },
            {
                "body": "Emily Watson gotta change her name. Everytime I read it I think \"yes my love is in this film\" to be didsapointed by no emma",
                "author": "empanadaboy68",
                "score": -33
            },
            {
                "body": "He's said he 'doesn't have the head for wigs'.",
                "author": "CalypsosBirthday",
                "score": 6
            },
            {
                "body": "One of my favourites! The marriage portrait by the same author is also brilliant 👌🏽",
                "author": "General-Butterfly864",
                "score": 31
            },
            {
                "body": "lewis* girl",
                "author": "ghiblix",
                "score": 20
            },
            {
                "body": "Have you seen all of us strangers or aftersun?",
                "author": "Barnacle_Savings1917",
                "score": 10
            },
            {
                "body": "Well most people see him as a talented actor and support him, nothing wrong with that",
                "author": "Long_Dragonfly_3067",
                "score": 15
            },
            {
                "body": "He is more Leo. Robert Patterson is closer to Lewis.",
                "author": "No-Raspberry7840",
                "score": 1
            },
            {
                "body": "Oh it's a book. Well. Alright.",
                "author": "TedKoppelz",
                "score": 53
            },
            {
                "body": "I did not like the book, either. And I really wanted to.",
                "author": "enogitnaTLS",
                "score": 1
            },
            {
                "body": "Also….Agnes? Not….Anne? Maggie, wtf are you DOING. ",
                "author": "Time-Environment5661",
                "score": -25
            },
            {
                "body": "Emily Watson was nominated for two Oscars before Emma Watson even started  secondary school.",
                "author": "MiamiLolphins",
                "score": 41
            },
            {
                "body": "I loved the marriage portrait even more than hamnet I think!",
                "author": "kitkatklock",
                "score": 9
            },
            {
                "body": "It’s the name of Shakespeare’s son.",
                "author": "biIIyshakes",
                "score": 79
            },
            {
                "body": "I wanted to like her writing, too! But it’s so overwritten and precious. I wanted to tear my hair out by the end of The Marriage Portrait. ",
                "author": "Time-Environment5661",
                "score": 3
            },
            {
                "body": "She intentionally used nontraditional spellings of the names to distinguish this further as pure fiction and not biographical fiction. O’Farrell used Agnes instead of Anne because “Agnes” was the name that was used in her father Richard Hathaway’s will. I think in the book they pronounce in “ahn-yes” or “an-yes” which is closer to “Anne.” Shakespeare’s character is also never named in the novel.",
                "author": "motherofdinos_",
                "score": 41
            },
            {
                "body": "Well. TIL that her name may have been Agnes! \n\nMOF is still a bad writer tho. ",
                "author": "Time-Environment5661",
                "score": -9
            },
            {
                "body": "She should still change her name",
                "author": "empanadaboy68",
                "score": -1
            },
            {
                "body": "Username checks out ",
                "author": "Time-Environment5661",
                "score": 29
            },
            {
                "body": "I am not a smart man.",
                "author": "TedKoppelz",
                "score": 55
            },
            {
                "body": "Yes! I only read Hamnet but it was kinda twee and not that deep? Hard to explain.\nAlso she mentions in the forward that she got the idea for the book from the fact that Shakespeare doesn’t mention the plague in any of his plays even though it was a major endemic at the time.\nBut I was pretty sure it’s a plot point in Romeo and Juliet so idk it was just weird.",
                "author": "enogitnaTLS",
                "score": 3
            },
            {
                "body": "Thank you! I’m so tickled to learn a new bit of Shakespeare info. I looked up AH on Wikipedia and found what you wrote about her father’s will. \n\nI still find MOF’s writing WAY too flowery but I appreciate your clarification on naming conventions in her books. ",
                "author": "Time-Environment5661",
                "score": 4
            }
        ]
    },
    {
        "title": "DOGE Put Critical Social Security Data at Risk, Whistle-Blower Says",
        "content": "",
        "author": "cmaia1503",
        "score": 214,
        "url": "https://www.nytimes.com/2025/08/26/us/politics/doge-social-security-data.html?unlocked_article_code=1.hE8.2T_2.PvwKjB-N84a3&smid=nytcore-ios-share&referringSource=articleShare",
        "created_utc": 1756215675.0,
        "comments": [
            {
                "body": "“Should bad actors gain access to this cloud environment, Americans may be susceptible to widespread identity theft, may lose vital health care and food benefits, and the government may be responsible for reissuing every American a new Social Security number at great cost,” \n\n\nJesus. We're screwed.",
                "author": "Yurple_RS",
                "score": 17
            },
            {
                "body": "Did anyone at any point, think he'd do anything else?",
                "author": "xtiaaneubaten",
                "score": 8
            },
            {
                "body": "r/collapse\n\n\nCould qualify for a checkpoint towards societal collapse",
                "author": "Disastrous-Resident5",
                "score": 5
            },
            {
                "body": "This is some traitor-teir dealings, if true. \n\nWhen I think about how the GOP went on and on about those fuggin emails just to be complicit in some bull shit like this…utter betrayal of the people.",
                "author": "work_jimjams",
                "score": 1
            }
        ]
    },
    {
        "title": "Marc Maron on Netflix choosing Dave Chappelle over the trans community: \"When they had pushback from the trans community about Chappelle, they realized after several days that that community was not going to affect their bottom line at all & they cut ‘em loose. That’s how fascism works in business.”",
        "content": "https://variety.com/2025/tv/news/marc-maron-slams-netflix-chappelle-bill-maher-desperation-1236497660/",
        "author": "cmaia1503",
        "score": 3991,
        "url": "https://i.redd.it/wbgbzhe908lf1.jpeg",
        "created_utc": 1756151572.0,
        "comments": [
            {
                "body": "&nbsp;\n\n&nbsp;\n&nbsp;✨🍯 **[JOIN THE FAUXHIVE](https://www.reddit.com/r/Fauxmoi/)** \n&nbsp;\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐝 **[APPLY TO BEE A MOD](https://forms.gle/q6pahnN4SbJTfatL9)**    \n                       \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🌺 **[MAKE REDDIT PINK AGAIN](https://www.reddit.com/r/Fauxmoi/wiki/index/pink/)**    \n            \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐦‍🔥 **[JOIN OUR FIRESIDE CHATS](https://www.reddit.com/r/Fauxmoi/?f=flair_name%3A%22FREE-FOR-ALL%22)**\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n☘️ **[ENTER OUR POP CULTURE BINGO](https://www.reddit.com/r/Fauxmoi/comments/1h62mch/2025_pop_culture_predictions_bingo)**      \n&nbsp;",
                "author": "rfauxmoi",
                "score": 1
            },
            {
                "body": "I mean . . . Where’s the lie?",
                "author": "Khmakh",
                "score": 469
            },
            {
                "body": "Maron's going all in on calling out the rot in the standup community, I'm here for it",
                "author": "timbop711",
                "score": 1683
            },
            {
                "body": "marc maron consistently out here validating my weird crush on him",
                "author": "motherfcuker69",
                "score": 376
            },
            {
                "body": "Common Marc Maron w",
                "author": "Suspicious-Penalty32",
                "score": 139
            },
            {
                "body": "My husband and I watched Marc Maron’s latest standup (Panicked) on HBO last week, and it’s so fucking good. He’s in a space we rarely see white men occupying: aging, grieving, insecure, and getting incredibly vulnerable with all of it. \n\nI know he’s not perfect - no one is, especially comedians - but damned if he’s not getting better with time. (Unlike Chappelle.)",
                "author": "auntieup",
                "score": 875
            },
            {
                "body": "Corporations don’t give a fuck about public. It’s always MONEY and MONEY. \nWelcome to Capitalism.",
                "author": "Lazy_Ad4370",
                "score": 176
            },
            {
                "body": "Marc Maron Coming out of his Well to shame mankind",
                "author": "OUtSEL",
                "score": 69
            },
            {
                "body": "I’m glad at least one big name in comedy is saying this shit. And nice bracket work, Variety. You can make LGBT content and still be transphobic pieces of shit. It really takes the air out of the full quote to throw in some corporation glazing.",
                "author": "human_kittens",
                "score": 107
            },
            {
                "body": "based",
                "author": "godzillaxo",
                "score": 47
            },
            {
                "body": "pretty much exactly how it works, and I would add that it goes beyond Netflix to the whole of the great deformed leviathan of corporatism. late cultural capitalism at its finest",
                "author": "Moriturism",
                "score": 43
            },
            {
                "body": "Marc Marion is so fucking real",
                "author": "aelewis92",
                "score": 34
            },
            {
                "body": "100% fuck Netflix and fuck Dave chapelle",
                "author": "BlackHatAnon",
                "score": 29
            },
            {
                "body": "Maron has really cut his way through his own bullshit to be on the right side of things. I can appreciate this type of growth for sure, and it makes me happier that the younger me, who was disappointed in a lot of Maron’s behavior (after loving his comedy), is finally getting vindicated.",
                "author": "ReyskiBlack",
                "score": 12
            },
            {
                "body": "Not relevant to this point specifically but do the shithead comic fans know lots of women (among others) find Maron pretty fucking sexy? Would it blow their minds or do they pissily suspect?",
                "author": "NoDoctor4460",
                "score": 18
            },
            {
                "body": "Everyone reacting to this by calling Marc just an embittered comedian should tell you their views on things going on.  He can be both bitter and right.",
                "author": "wolf_at_the_door1",
                "score": 15
            },
            {
                "body": "Maron has always been against these \"edgy\" comics who constantly do low hanging fruit. his take is always, whenever comedian complains audiences are took woke, all he hears is, \"I don't know how to be funny anymore.\"\n\n  \n\"Everyone who says 'they not let you say anything any more' only ever wants to say same three things.\"",
                "author": "ChocolateOrange21",
                "score": 10
            },
            {
                "body": "Common Maron W",
                "author": "PrfsrMoriarty",
                "score": 13
            },
            {
                "body": "Cancelled my Netflix in February as protest. Not going back. ",
                "author": "MindComprehensive440",
                "score": 17
            },
            {
                "body": "https://preview.redd.it/3e6cc7uv89lf1.jpeg?width=1170&format=pjpg&auto=webp&s=b3073ed6e31c97d7a1b192d18424ac5ab9ffd1a3",
                "author": "hi_cholesterol24",
                "score": 8
            },
            {
                "body": "Another based take",
                "author": "ooowatsthat",
                "score": 11
            },
            {
                "body": "Maron being maron",
                "author": "carr0ts",
                "score": 9
            },
            {
                "body": "It's what American Eagle and Sydney Sweeney are relying on after those ads. That only a small amount of people care and are willing to boycott. Despicable.",
                "author": "roseemrys",
                "score": 11
            },
            {
                "body": "Marc Maron is the GOAT",
                "author": "Stephen-Friday",
                "score": 10
            },
            {
                "body": "I'm a regular listener of Pod Save America, and Jon Lovett is easily my favorite host on the podcast.\n\nThe entire interview is very good, and Marc Maron has some unique insights on his perceived responsibilities as a comic.",
                "author": "Interlined",
                "score": 6
            },
            {
                "body": "It's pretty apparent that quite a lot of people would be willing to drop the trans community the moment it becomes easy, we become too big of a problem, or we get too outspoken. Look at any of the current discourse around Gavin Newsom and how people will downvote any comment pointing out his transphobia in pretty left leaning subreddits. Then there's the entire Harry Potter stuff where asking people not to support a pure transphobe will be met with downvotes and excuses. It's hard to blame Netflix when the consumers also are on same wavelength there; if Netflix thought pushing anti-trans content would make them lose subscribers, they wouldn't do it.",
                "author": "Lizzy_Reeds",
                "score": 4
            },
            {
                "body": "They didn't just ditch the T, they also ditch the other Letters of LGBT on a regular basis.\n\n# Dead Boy Detectives, Uncoupled, Q-Force, 1899, First Kill, AJ and the Queen, Smiley, Half Bad: The Bastard Son & The Devil Himself, Gypsy (starring Naomi Watts), I Am Not Okay With This, Super Drags, Lockwood & Co, The Society, Kaos.\n\nAll canceled after one season, some even with cliffhangers.",
                "author": "Sea_of_Light_",
                "score": 6
            },
            {
                "body": "Drag him king",
                "author": "Dictionary_Goat",
                "score": 7
            },
            {
                "body": "it's why JK Rowling keeps getting work and why it won't be anytime soon that transphobia is a truly cancelable offense. \n\nIt doesn't affect the bottom line. When that game came out and there was a boycott that it's fair to say didn't work, it really emboldened people.",
                "author": "achlys333",
                "score": 6
            },
            {
                "body": "Our entertainment industry has been fueling the maga flavored fascism flames for a while. It’s part of the reason Sydney Sweeney thinks her MAGA grift is going to work for her. You can see trends in beauty, fashion, bodies, and on the screen. It’s horrifying but also fascinating.",
                "author": "Acrobatic_Builder573",
                "score": 3
            },
            {
                "body": "Dave Chappelle is stuck in 2007",
                "author": "Brianocracy",
                "score": 4
            },
            {
                "body": "Fascism and capitalism go hand in hand",
                "author": "Monokuma_Koromaru",
                "score": 3
            },
            {
                "body": "You go King! You are on the right side of history!!!!",
                "author": "_Cerca_Trova_",
                "score": 4
            },
            {
                "body": "Didn't Dave Chappelle himself have to go to war, so to speak, with Netflix because they didn't pay him for Chappelle's Show when they were initially streaming it?\n\nI feel like this is probably just a numbers thing for Netflix. Which of course makes Maron right.",
                "author": "Skelemania",
                "score": 3
            },
            {
                "body": "I don't know what anti Marc Maron campaign I fell for decades ago, but until this last year, I was convinced I hated this guy. But lately I've realized I agree with a lot of his points, and I guess I'm just curious who tried to take this man down so long ago lol.",
                "author": "embalmedwithsewage",
                "score": 2
            },
            {
                "body": "Man’s not wrong",
                "author": "GoldenboyFTW",
                "score": 2
            },
            {
                "body": "Mark entering his less than zero F’s era.",
                "author": "Estania_Lane",
                "score": 1
            },
            {
                "body": "I've been a fan of Maron since before the podcast, but he's become one of my favorite guys in recent days. Man, what an icon.",
                "author": "IShallWearMidnight",
                "score": 1
            },
            {
                "body": "I first heard of Marc on a Netflix show called Easy and became fascinated with his character and him. Glad to see he seems like a pretty decent person!",
                "author": "saccharinefawn",
                "score": 1
            },
            {
                "body": "Netflix and the U.S. are run the same. That's Capitalism. How does anyone not understand that the people with the power DO NOT GIVE A FUCK ABOUT YOU OR YOUR LIFE? Especially when they are mostly allll the same old rich white dudes. They stopped pretending to care about Pride or recognize the value of DEI the SECOND they had a choice and thought pandering to their fellow fascists would be more profitable.\n\nIf you cost the powerful ANY amount of money they want you dead. If you can make them enough money to justify investing the time it takes them to convince you there is hope of becoming rich like them if you just *keep working hard*- they'll do that. If Netflix could make money- they'd air a real life Squid Game. \n\nIt's the architecture of the every corporation. Netflix, and the fucking U.S.A. This is why they want us to know they will put more resources into finding Luigi, than they will anyone and everyone else. They do not give a hot fuck about serial rapists and murderers or that dude who killed his 3 daughters back in May (who they have not found)...\n\nthey want to scare everyone into inaction who threatens The power structure, or even thinks to support people with the balls to threaten it. \n\nOf course they chose Chappelle! Collectively we can't even be bothered to boycott the shittiest streaming app around to send the only message that would matter. ",
                "author": "CuntumaciousMe",
                "score": 1
            },
            {
                "body": "I read this as Macron initially 💀💀💀",
                "author": "Embarrassed_Purple55",
                "score": 1
            },
            {
                "body": "I have nothing but love for the trans community and agree with his point overall, but is that really fascism? Even taking it as he's saying it isn't it just a business choosing to make money over taking a moral stand?",
                "author": "ThatTalk2768",
                "score": 1
            },
            {
                "body": "Using a picture of him wearing a red hat feels... Intentional.",
                "author": "Possible-Courage3771",
                "score": 1
            },
            {
                "body": "I misinterpreted this title of this post and thought it meant Maron was on some Netflix show saying he supports Dave Chappelle. Glad that’s not the case!",
                "author": "midwestprotest",
                "score": 1
            },
            {
                "body": "A second season of Glamorous with Miss Benny coming into her own as a trans woman would have been excellent, that show and cast was such fun. But no we get more heaps of ugly shit like this.",
                "author": "Bleuberries6",
                "score": 1
            },
            {
                "body": "Those brackets are doing some heavy lifting for Netflix. Their ad share in Variety must be significant",
                "author": "HopefulTangerine5913",
                "score": 1
            },
            {
                "body": "I think this is a nice way of putting it but for those who prefer a messy bitch criticism of Netflix and Chappelle, Marc also said that Netflix was ruining comedy by giving lazy comedians who show up drunk to their shows tons of money.",
                "author": "namegamenoshame",
                "score": 1
            },
            {
                "body": "I challenge Marc Maron to join me in Ohio and fight Dave Chappelle…and also to go on a date with me! \nAccept or perish, Marc!",
                "author": "AmberCarpes",
                "score": -3
            },
            {
                "body": "Chapelle is not the enemy.",
                "author": "AccordingMedicine129",
                "score": -9
            },
            {
                "body": "Can’t believe I’ve enjoyed his press tour for his latest standup more than his latest standup.",
                "author": "BarkansasJane",
                "score": 0
            },
            {
                "body": "Chappelle is right. Love Maron. He's no Chappelle.",
                "author": "sarabori",
                "score": -1
            },
            {
                "body": "How you feel about Israel, Marc?",
                "author": "bluehoag",
                "score": -37
            },
            {
                "body": "Not there, that’s for damn sure! \n\nHurrah for Marc Maron.",
                "author": "Likeatoothache",
                "score": 20
            },
            {
                "body": "I loved him in G.L.O.W. and had no idea he was a comedian. He's definitely one of my favorites now. \n\nI'd love to see him and Bill Burr take flight on these shithead \"comedians\" like Chris D'Pedo.",
                "author": "reshef-destruction",
                "score": 311
            },
            {
                "body": "And the hacks are all throwing tantrums over it trying to label him a nobody or a has been. Dude is staring on an Apple+ show and is retiring his podcast after leading the industry for almost 2 decades. Jealous of who exactly?",
                "author": "gnrc",
                "score": 50
            },
            {
                "body": "Seems to be one of the very few with moral clarity in the entertainment business.",
                "author": "No_Dance_6683",
                "score": 18
            },
            {
                "body": "I liked his recent stand up special. My household also hates this fascist admin and has three cats",
                "author": "rhombecka",
                "score": 15
            },
            {
                "body": "I feel hes a little late with this one",
                "author": "charleechuck",
                "score": -10
            },
            {
                "body": "I met him briefly years ago at a comedy show and I was crushing so hard I could barely speak lol. Made a fool of myself but I am so happy that someone I have admired continues to be admirable in these times.",
                "author": "One_Huckleberry_5033",
                "score": 126
            },
            {
                "body": "Wait is this considered weird? I've always thought he was really hot. Crushable in a \"I find his grumpiness appealing but he might be a nightmare to actually be involved with\" way.",
                "author": "Far-Advance-9866",
                "score": 61
            },
            {
                "body": "Would.",
                "author": "CaribouHoe",
                "score": 34
            },
            {
                "body": "Most based Lib comedian tbh",
                "author": "Gardenheadx",
                "score": 8
            },
            {
                "body": "He isn't perfect but he isn't a damn hack that turned their comedy into rightwing grievance",
                "author": "Bag_of_Meat13",
                "score": 271
            },
            {
                "body": "Maron's biggest flaw is making us think it was acceptable for white men to have podcasts.",
                "author": "drcolour",
                "score": 387
            },
            {
                "body": "its nice to see this, and the thing about Chappelle is that it really is a big disappointment but sorta not surprising giving the fact that, altho his racial commentary is stellar, its mainly centered from a cishet black male's POV",
                "author": "euphoricbisexual",
                "score": 89
            },
            {
                "body": "Maron is not perfect but he is so genuine. He’s the closest to Carlin we still have.",
                "author": "AuldTriangle79",
                "score": 65
            },
            {
                "body": "My only gripe--and this isn't directed at Maron, more so HBO's marketing department (and it's a little ironic too, given that this post is about Maron calling out Chappelle)--is that the one joke that has gotten clipped and made the algorithmic rounds is the \"progressives need to figure out the whole buzzkill thing/we annoyed the average American into fascism\".\n\nIt's such a funny joke, but only if you're in on the joke. Otherwise--and this is the irony with Chappelle--you end up with a Chappelle's Show situation, where the audience isn't laughing for the right reason.\n\nMy gut says that the majority of people who come across that particular snippet of the special get the joke the way Maron intended it, but I'm also positive that HBO clipped that joke in particular because there are enough viewers out there who will laugh because \"heh yeah, those whiny snowflakes are a bunch of annoying buzzkills, this guy gets it\".\n\nGranted, if they decide to watch the special after that, they'll quickly find out Maron is not, in fact, on \"their side\", but it just really felt like a conscious decision to clip that joke in particular.",
                "author": "eggs_and_bacon",
                "score": 27
            },
            {
                "body": "I was cry laughing during that special.",
                "author": "Lokaji",
                "score": 12
            },
            {
                "body": "I watched his show and was not obsessed but kind of",
                "author": "Sproose_Moose",
                "score": 6
            },
            {
                "body": "♫ Coming out of my well and I've been shaming mankind ♫",
                "author": "MCMACDANOLDs",
                "score": 27
            },
            {
                "body": "Omg I’d give you gold if I had it 🏆🫡",
                "author": "HonestNectarine7080",
                "score": 8
            },
            {
                "body": "Just variety being variety.",
                "author": "drcolour",
                "score": 23
            },
            {
                "body": "Whats wrong with the ads?",
                "author": "AccordingMedicine129",
                "score": -15
            },
            {
                "body": "pod save america are paid DNC shills. you can even see it at close to the 25 minute mark where you can hear he's going to criticize Newsom and they IMMEDIATELY cut to a commercial about underwear. pathetic",
                "author": "Immediate_Event985",
                "score": 2
            },
            {
                "body": "what does that mean",
                "author": "fourofkeys",
                "score": 10
            },
            {
                "body": "Still mourning GLOW",
                "author": "gschaina",
                "score": 172
            },
            {
                "body": "He’s really good in the new Apple TV show Stick with Owen Wilson. He plays his curmudgeonly self, naturally",
                "author": "Bebopdavidson",
                "score": 23
            },
            {
                "body": "He was fantastic in the underappreciated movie To Leslie a few years ago too",
                "author": "MoistMucus4",
                "score": 8
            },
            {
                "body": "I love Maron, but seeing Bill Burr going off is even better because he was friends with the Austin scene guys and is pulling away but still gets to call them on their shit to their face and they just clearly have no fightback to justify their shitty comedy when confronted.",
                "author": "radioactivethighs",
                "score": 6
            },
            {
                "body": "Honestly I think he's always been like this, I am a longtime stand up fan and even before Chappelle started going bad his take was usually \"if people are complaining you're offending them, you are probably a hack who needs to get better at stand up.\"  It's just making news right now because he's on an intense tour to promote his new HBO special and people keep asking him specific questions about it.",
                "author": "listenyall",
                "score": 1
            },
            {
                "body": "I had the opposite personal interaction with him so witnessing his recent stuff has made me bury a very petty hatchet",
                "author": "IShouldBWorkin",
                "score": 39
            },
            {
                "body": "he’s handsome in a sad guy you pick up during last call at the bar kind of way",
                "author": "motherfcuker69",
                "score": 11
            },
            {
                "body": "I think he's said that about himself before. I feel this way about Nick Kroll; gosh, your heart is in the right place but I feel like he'd have to be home for a few days to turn it off.\n\n\nMy perfect comedian is Charlie Day or Aisling Bea. I love that he hasn't been affected by Hollyweird and she's just funny and gorgeous.",
                "author": "No-Courage-5109",
                "score": 14
            },
            {
                "body": "https://www.youtube.com/watch?v=wPs1aSHmrg0\n\nMarc got better as he aged for sure.",
                "author": "tempest_",
                "score": 2
            },
            {
                "body": "And he admits that too.",
                "author": "gnrc",
                "score": 37
            },
            {
                "body": "![gif](giphy|eb6aLYooxtu4Ez9Ng2)\n\nLMAO",
                "author": "Dee_Imaginarium",
                "score": 64
            },
            {
                "body": "I was such a fan of Chappelle once. He was funny, courageous, and a truth teller even when he wasn’t funny. “8:46” is one of the coolest performances I will ever see. \n\nSomething had changed about him by the time he hosted SNL later that year, and he’s steered hard into that skid ever since. I don’t know whether a trans woman rejected his advances or what, but he’s got some self-hatred going on that I wish he’d just resolve already. He’ll remain unwatchable until he does.",
                "author": "auntieup",
                "score": 53
            },
            {
                "body": "Fuck, I need this as my flair.",
                "author": "OutOfEffs",
                "score": 12
            },
            {
                "body": "I bet you can figure it out bigboy",
                "author": "Actual_Rip2230",
                "score": 2
            },
            {
                "body": "I don't agree with them on everything, but they certainly are quite critical of the DNC, particularly the current lack of party leadership.\n\nI don't particularly respect the New York Times, but I still regularly listen to The Daily.\n\nI like to expose myself to news and political discourse, even if I disagree with it. I can check sources, research topics, and form my own conclusions.",
                "author": "Interlined",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": 19
            },
            {
                "body": "Same. Netflix is too fickle with canceling stuff.",
                "author": "reshef-destruction",
                "score": 46
            },
            {
                "body": "There was absolutely no reason for that show to end. I’m still holding onto hope that some other network can pick it up even though it’s been years since it was cancelled💀",
                "author": "margr3t_m",
                "score": 14
            },
            {
                "body": "He was briefly in Rez Dogs on Hulu (or FX?) and was great there too.",
                "author": "Yeehasmush",
                "score": 14
            },
            {
                "body": "Like it was a comedy show and he met fans after but wasn’t nice?",
                "author": "DazzlingCapital5230",
                "score": 16
            },
            {
                "body": "Funny cuz Trixie is my favourite podcaster. Is she a Republican Christian ruthless capitalist woman? Yes. But I think in my heart she might change one day.",
                "author": "TuvixWillNotBeMissed",
                "score": 25
            },
            {
                "body": "yea I was like wow but I mean he pretty much told us that he danced with a trans woman at the club and when the lights came on and he saw who she was he was upset and offended. He said all that in one of his return standups",
                "author": "euphoricbisexual",
                "score": 18
            },
            {
                "body": "Dude's very vocal about low hanging fruit (Trump and his authoritarianism); he's less ready to speak on more controversial topics like Israel's absolute genocide of Palestinians and neoliberalism/oligarchy. I'll happily repeat this.",
                "author": "bluehoag",
                "score": -11
            },
            {
                "body": "COVID killed it from my understanding. They were supposed to start filming the final season right at the beginning of the pandemic and they couldn’t make filming the wrestling covid-safe. Sets got torn down, people moved on and by the time they could have done it, it was too late.",
                "author": "PLAAND",
                "score": 20
            },
            {
                "body": "No, he came into a coffee shop I was working at and was rude in a way that I would have immediately forgotten about the night of had it not been done by a person who did stuff I previously liked",
                "author": "IShouldBWorkin",
                "score": 6
            },
            {
                "body": "wait really? Trixie, a drag queen, being a republican ?",
                "author": "MrDannn",
                "score": 1
            },
            {
                "body": "This is so beyond idiotic. He’s talked about all of this on his podcast within the last six months. I’m sorry he’s not spamming his social media your memes.",
                "author": "namegamenoshame",
                "score": 5
            },
            {
                "body": "Also with season 3 and beyond contracts change and you have to start paying people more.",
                "author": "PixelAntique",
                "score": 8
            },
            {
                "body": "It's a bit from the podcast, not for real lol",
                "author": "Dee_Imaginarium",
                "score": 11
            },
            {
                "body": "Leopard awaiting face type situation",
                "author": "Oscar_Dot-Com",
                "score": -5
            },
            {
                "body": "[This is him on Israel and Palestine](http://www.wtfpod.com/dispatches/where-i-stand). It's pure Liberal Zionism, something any genocide scholar will tell you reifies the loss of life in Palestine. Again, I'll repeat it.",
                "author": "bluehoag",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": 0
            },
            {
                "body": "Show me where he changed his mind.",
                "author": "bluehoag",
                "score": 1
            },
            {
                "body": "what does the comment above yours say.",
                "author": "fourofkeys",
                "score": 1
            },
            {
                "body": "The comment above me is deleted. It did say: \"That was two years ago.\"",
                "author": "bluehoag",
                "score": 1
            }
        ]
    },
    {
        "title": "Noah Centineo shares a behind the scene look of him as Ken Masters in the upcoming live-action ‘Street Fighter’ movie.",
        "content": "",
        "author": "cmaia1503",
        "score": 69,
        "url": "https://i.redd.it/oba4ry2dx7lf1.jpeg",
        "created_utc": 1756150598.0,
        "comments": [
            {
                "body": "&nbsp;\n\n&nbsp;\n&nbsp;✨🍯 **[JOIN THE FAUXHIVE](https://www.reddit.com/r/Fauxmoi/)** \n&nbsp;\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐝 **[APPLY TO BEE A MOD](https://forms.gle/q6pahnN4SbJTfatL9)**    \n                       \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🌺 **[MAKE REDDIT PINK AGAIN](https://www.reddit.com/r/Fauxmoi/wiki/index/pink/)**    \n            \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐦‍🔥 **[JOIN OUR FIRESIDE CHATS](https://www.reddit.com/r/Fauxmoi/?f=flair_name%3A%22FREE-FOR-ALL%22)**\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n☘️ **[ENTER OUR POP CULTURE BINGO](https://www.reddit.com/r/Fauxmoi/comments/1h62mch/2025_pop_culture_predictions_bingo)**      \n&nbsp;",
                "author": "rfauxmoi",
                "score": 1
            },
            {
                "body": "This feels unnecessary",
                "author": "FlowersByTheStreet",
                "score": 658
            },
            {
                "body": "Get this man a glass of water. I feel the dehydration radiating through the screen ",
                "author": "gib095",
                "score": 349
            },
            {
                "body": "He looks like he is really struggling with that pose. His face looks pained.",
                "author": "ebbtideisalive",
                "score": 149
            },
            {
                "body": "People shouldn't look like this. Drink some fluids.",
                "author": "fleurdenise",
                "score": 131
            },
            {
                "body": "No one can convince me this film is going to be good.\n\nI am sorry girlies.",
                "author": "CranberryPuffCake",
                "score": 220
            },
            {
                "body": "This appeals only to the male gaze. I look at this and am concerned for his kidneys above all else.",
                "author": "thatisnotmyknob",
                "score": 68
            },
            {
                "body": "Theres no reason for to being all that for this movie",
                "author": "BotGirlFall",
                "score": 27
            },
            {
                "body": "I can never unsee this now (not in a good way).",
                "author": "sashgray",
                "score": 44
            },
            {
                "body": "Let’s talk about the romance he had with Zoe Kravitz for a couple months… \n\nAlso he’s been cute once and once only in that To All the Boys movie, the first one. I find him only endearing and hot when he’s playing Peter Kavinsky.",
                "author": "Overall-Bar-6060",
                "score": 88
            },
            {
                "body": "It’s giving Florida man",
                "author": "BlondeBorednBaked",
                "score": 58
            },
            {
                "body": "look what they did to my boy 😭",
                "author": "Emergency_Night_145",
                "score": 18
            },
            {
                "body": "And I’m scared",
                "author": "CartridgeFrog",
                "score": 34
            },
            {
                "body": "There is no reason anyone needs to look like this unless you make REALLY good money throwing cars off of bridges or something ",
                "author": "Bitter_Kangaroo2616",
                "score": 17
            },
            {
                "body": "The idea of street fighter having a plot is so funny",
                "author": "Plastic_Ad2328",
                "score": 30
            },
            {
                "body": "Nothing about this is attractive to me.",
                "author": "an-inevitable-end",
                "score": 11
            },
            {
                "body": "I don't know if it's the angle but this picture is proof that abs are not for everyone. I loved his original look.",
                "author": "nouvelle_tete",
                "score": 10
            },
            {
                "body": "![gif](giphy|Yu2BblKc3011e)\n\n.....uh uh, this is not proper representation. The hair is such a concern for me 😟",
                "author": "darkgothamite",
                "score": 10
            },
            {
                "body": "Yeesh\n\n![gif](giphy|SWRLBcaXHaiU5krCKx)",
                "author": "follyodd",
                "score": 9
            },
            {
                "body": "Steroids and HRT are slowly killing male celebrities. I am terrified of what is going to happen to them as they age.",
                "author": "anarchomeow",
                "score": 19
            },
            {
                "body": "Isn’t Ken half-Japanese?",
                "author": "jejunedugong",
                "score": 7
            },
            {
                "body": "Can't we just get a Castlevania like animated show for Street Fighter instead? 😭😭",
                "author": "Saints_N_Sinners_7",
                "score": 7
            },
            {
                "body": "noah scented mayo",
                "author": "mabiskywisky",
                "score": 15
            },
            {
                "body": "![gif](giphy|xT9IgrlyzJlE6ljtS0)",
                "author": "theeloglady",
                "score": 6
            },
            {
                "body": "It’s funny because there are pro wrestlers in this movie and they’re actually properly ripped without looking like they’ve never had a glass of water in their lives.",
                "author": "General-Roll8107",
                "score": 4
            },
            {
                "body": "I am so sick of this Triumph of the Will era of movies. More Michael Ceras and less Liver King bods, please!",
                "author": "Big-Snow-1937",
                "score": 21
            },
            {
                "body": "Natty for sure.",
                "author": "Nice-Web583",
                "score": 3
            },
            {
                "body": "He looks different in every picture he takes.",
                "author": "Jenny_Saint_Quan",
                "score": 3
            },
            {
                "body": "One of the most blatant \"so, we're not going to say it out loud?\" pics since the He-Man set pics.",
                "author": "amara90",
                "score": 3
            },
            {
                "body": "A lot of the stars posted on set stuff from this movie and it looks so bad... Andrew Schultz (🤢) playing Hibiki was the first red flag but Orville Peck in his Vega hair looks so awful.",
                "author": "King_Slowpoke",
                "score": 3
            },
            {
                "body": "There is some weird photo shopping happening there. Why aren’t nipples aligning? One is lower than the other. There’s also something going on in the waist area.",
                "author": "Khmakh",
                "score": 5
            },
            {
                "body": "But he’s the Internet’s boyfriend!",
                "author": "Key-Status-7992",
                "score": 1
            },
            {
                "body": "i hate absolutely everything i see about this movie. at least the old one had kylie.",
                "author": "guict302",
                "score": 1
            },
            {
                "body": "\"Do you squirt?\" is about to be in a movie with Roman Reigns and Cody Rhodes 😭😭😭",
                "author": "NoWayBirdBrains",
                "score": 1
            },
            {
                "body": "Yikes",
                "author": "frosting_freak",
                "score": 1
            },
            {
                "body": "No.",
                "author": "carbonpeach",
                "score": 1
            },
            {
                "body": "I do not see Ken when I look at this guy. They got the wrong guy",
                "author": "WilliamBoimler",
                "score": 1
            },
            {
                "body": "Is he trying to get Zoe’s attention again or what",
                "author": "ratedefor",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": -19
            },
            {
                "body": "This is like Zac Efron resorting to DRINKING (yes, *drinking*) finely ground chicken to pack on the protein to look immaculately, creepily lean and muscular…for “Baywatch”, of all things. He was so outrageously ripped and tormented for a comedy that wasn’t good, didn’t get good reviews, and was based on a show with men who were muscular in a much more normal way.",
                "author": "CatofKipling",
                "score": 344
            },
            {
                "body": "funnily enough, the first thing I zeroed in on in this picture was that box on the counter, which just so happens to be ✨mineral rich water from the Australian Alps✨ (Beloka water)",
                "author": "cinnamus_",
                "score": 58
            },
            {
                "body": "This does not look dehydrated at all.",
                "author": "Pristine-Warthog-320",
                "score": -12
            },
            {
                "body": "yeah my first thought was this is kinda disturbing",
                "author": "31cats",
                "score": 39
            },
            {
                "body": "I love that we are all on the same page about this",
                "author": "Bitter_Kangaroo2616",
                "score": 30
            },
            {
                "body": "Half the cast seems to be WWE people.\n\nSurprised that Dwayne Johnson hasn't been cast as some character in the movie.",
                "author": "Drachen1065",
                "score": 58
            },
            {
                "body": "I’m with you. \n\nSo yet another shitty Street Fighter movie will exist",
                "author": "ace-destrier",
                "score": 18
            },
            {
                "body": "They have made two film adaptations already (not counting the animated films) - Street Fighter (1994) and Street Fighter: The Legend of Chun-Li (2009) - and neither of them have done very well. Street Fighter grossed $99 million against a $35 million budget (though notably, most of this was from the film's international release, with the domestic take only being $33 million). And Chun-Li was a box office flop with a $12.8 million worldwide gross against a $50 million budget.\n\nThat combined with the fact that a lot of video game adaptations struggle at the box office (there's exceptions sure but as a whole, a lot have not done well) does not bode well for this movie.",
                "author": "theagonyaunt",
                "score": 7
            },
            {
                "body": "It has some of the worst casting I’ve ever seen",
                "author": "Bardic_inspiration67",
                "score": 5
            },
            {
                "body": "Same.",
                "author": "Overall-Bar-6060",
                "score": 3
            },
            {
                "body": "Here's hoping its at least entertainingly silly. Just give us some good fights and some campy lines, and it might be worth at least a rental. ",
                "author": "QUEST50012",
                "score": 1
            },
            {
                "body": "Isn’t it funny that he posts this once Zoe is spotted with Harry styles. After not really posting anything for months. Single and ready to mingle. \n\nAnyway I wouldn’t call it a romance. that was more a little site specific fling when they were in the  same city but once they got busy having to do things in other places and evidently train etc it just fizzled out",
                "author": "AdventurousBet5128",
                "score": 26
            },
            {
                "body": "I did find him very charming and funny in the first season the *The Recruit*.\n\nHaven't seen the second season yet.",
                "author": "wisusececss",
                "score": 4
            },
            {
                "body": "Bold of you to assume the movie will have a plot",
                "author": "SugarShock94",
                "score": 14
            },
            {
                "body": "We need more blonde representation fr",
                "author": "sabhall12",
                "score": 3
            },
            {
                "body": "I know multiple men who have used TRT (not medical)  and I looked into it and was very very disturbed. It explained the whole red pill thing even more.",
                "author": "Bitter_Kangaroo2616",
                "score": 11
            },
            {
                "body": "No, he's 3/4th Japanese. His dad is Japanese and his mother is half Japanese. Hollywood whitewashing another Asian character. news at 11.",
                "author": "Gayfetus",
                "score": 13
            },
            {
                "body": "Triumph of the Will is literal N*zi propaganda. Is that what you mean? Because I don’t see how this is related.",
                "author": "sydbap",
                "score": 7
            },
            {
                "body": "i could’ve gone my whole life without learning this tidbit. i cannot even…DRINKING chicken?????",
                "author": "chaiskeleton",
                "score": 129
            },
            {
                "body": "In addition, they also don't drink water within hours of different shots. None of it makes any sense. None of these roles are better for it. Normal muscular is all that is needed to let the audience know who the character is supposed to be",
                "author": "Bitter_Kangaroo2616",
                "score": 62
            },
            {
                "body": "Whenever a male celebrity talks about their monotonous 'chicken breast and broccoli' diet to be shredded for role, you can mentally replace chicken and broccoli with steroids and HGH",
                "author": "meatbeernweed",
                "score": 123
            },
            {
                "body": "Literally just “watched” that movie while organizing my closet. The dialog was absolutely terrible.",
                "author": "roastbeefbee",
                "score": 13
            },
            {
                "body": "I remember that clip of him getting so emotional over eating pasta. I felt so bad for him. These actors are doing so much harm to their mental health and their bodies for roles. This shouldn’t be the norm. \n\nI also remember being genuinely worried for Christian Bale for quite some time, that Machinist to Batman transformation cannot have been good for his health.",
                "author": "absolutebeast_",
                "score": 18
            },
            {
                "body": "if you didn’t know, dehydration makes the muscles pop out more. it’s common in body building competitions not to drink for several hours before an event.",
                "author": "theserthefables",
                "score": 7
            },
            {
                "body": "Shocked John Cena isn’t cast as Guile and that it’s being played by a lesser known wrestler ",
                "author": "Dry-Yak5277",
                "score": 21
            },
            {
                "body": "Hey now, the 94 movie was camp and had Raul Julia absolutely killing it as Bison because he wanted to make his kids happy. Plus the arcade game for it is damn fun.\n\n\nThis one though? Oof. ",
                "author": "Zeether",
                "score": 35
            },
            {
                "body": "They don't struggle anymore, if anything the exception is to fail",
                "author": "Repulsive_March5601",
                "score": 3
            },
            {
                "body": "I doubt it was really a romance, from what some of his influencer exes have said about him, that man keeps a \"LA girlfriend\" and pretty much does whatever he wants when he's out of the city.",
                "author": "oceanolivaw",
                "score": 2
            },
            {
                "body": "I know. I was joking. I never meant it as they were in love or anything like that.\nAs someone who really doesn’t care about any of the players and is entertained when something like this happens: I’m thoroughly enjoying Harry Styles’s fans’ insanity ",
                "author": "Overall-Bar-6060",
                "score": 6
            },
            {
                "body": "A lot of them have no idea how to use it correctly or safely. I see ads for it online with absolutely NO WARNINGS.\n\nWhen I took HRT as a young trans person, I did it under the supervision of a doctor with frequent blood work and appointments.\n\nCis guys today are just winging it with no idea of the consequences.",
                "author": "anarchomeow",
                "score": 9
            },
            {
                "body": "What was disturbing?",
                "author": "Historical-Figure875",
                "score": 1
            },
            {
                "body": "I had no idea! I always thought he was white in the video game",
                "author": "gailanisgood",
                "score": 3
            },
            {
                "body": "I'm not sure if Capcom even remembers this. Jill Valentine from Resident Evil is also supposed to be half Japanese according to a press release fir the first game, but you sure can't tell by the way she looks.\n\n\nAnd neither Ken nor Jill's parents have been shown onscreen.",
                "author": "Cicada_5",
                "score": 3
            },
            {
                "body": "I do think the focus on a particular hyper-sculpted muscular body type that has built and intensified over the last 10 years to its current peak is closely correlated with the MAGA era, its fascist policies, and its emphasis on an exaggerated physical aesthetic (Rogan/RFK HGH muscles on men and Noem/Guilfoyle facial and lip fillers and big hair on women). \n\nMedia (including and especially social media) is inundated with this look now, which does read to me as propaganda. (I’m not saying most of the actors involved are intentionally doing this, they are just following the trends needed for employment.)",
                "author": "Big-Snow-1937",
                "score": 13
            },
            {
                "body": "How fowl.",
                "author": "mai_tai87",
                "score": 125
            },
            {
                "body": "Charlize Theron drank melted ice cream in the night to gain weight for that movie Tully I think? ",
                "author": "Bitter_Kangaroo2616",
                "score": 12
            },
            {
                "body": "That’s so funny because that is also a recipe for homemade cat squeeze treats",
                "author": "bahia6",
                "score": 2
            },
            {
                "body": "I think it's more like no water for 2 days.",
                "author": "Stevenwave",
                "score": 6
            },
            {
                "body": "I think it's more like no water for 2 days.",
                "author": "Stevenwave",
                "score": 2
            },
            {
                "body": "Exactly. And I wish we'd stop talking around it or get scolded for stating the obvious.",
                "author": "amara90",
                "score": 37
            },
            {
                "body": "Also the fact that even with steroids diet is HUGELY important and that isn't the diet they would have even been on. You need fats to put muscle on. It's dangerous on both levels. It causes body dysmorphia within gym goers and subsequent eating disorders that are based on lies. \n\nI love the gym, but I'm glad I'm happy with 14-18% body fat and actual enjoyable meals. When I bulk I can have 3400 calories a day and that's a lot easier with food that isn't just chicken and brocoli (although I keep it fairly in line with the recommended macros for gaining muscle.)",
                "author": "GodsBicep",
                "score": 6
            },
            {
                "body": "This is why I felt sorry for him when his jaw ended up looking “different” after Iron Claw. There was a brief point where he changed his accent most peculiarly (to something more city?). Then he also looked embarrassed once when proud sadist Ellen brought out a shirtless cardboard cutout of him on her show and he said “I don’t want people to think it’s easy to get a body like this”. Add addiction to the mix and I’m seeing some major identity issues, some major self-image/self-esteem problems. \n\nBut these producers and executives are probably like “YA MAN! Get the body transformation press! Work out as hard as you fucking can! There’s no other you can pull any of this off!”. \n\nPS- these actors famously crash-out after these intense body transformations too. They often end up losing the immaculate abs/pecs/shoulders in a matter of weeks. Imagine what that does to your ego.",
                "author": "CatofKipling",
                "score": 13
            },
            {
                "body": "Don’t feel bad, they can say no to these roles.",
                "author": "violetferns",
                "score": 0
            },
            {
                "body": "I’m very much aware. He is not even close to bodybuilder-level dehydration. He just has low body fat/probably had a pump",
                "author": "Pristine-Warthog-320",
                "score": 4
            },
            {
                "body": "Cody Rhodes?  \n\nI was under the impression he's currently #1 or 2 in the WWE or whatever name they use now.",
                "author": "Drachen1065",
                "score": 17
            },
            {
                "body": "Cody looks like guile and is extremely well known.",
                "author": "mattmurdick",
                "score": 7
            },
            {
                "body": "Cody Rhodes is one of the current top names in WWE, he’s massive in that company.",
                "author": "iamHBY",
                "score": 1
            },
            {
                "body": "The Cody Rhodes slander will not be tolerated! He is the current babyface when Cena went heel. Which apparently they are going reverse because it’s not doing so well for their rating. \n\nI literally watched two Smackdowns and caught up to the last two years of WWE, it’s such soap opera.",
                "author": "jadelikethestone",
                "score": 0
            },
            {
                "body": "You’re right. I can appreciate camp. And Raul Julia of course. What a movie to be your final one lol RIP",
                "author": "ace-destrier",
                "score": 12
            },
            {
                "body": "The 94 movie also had a far better soundtrack than it seemingly deserved. Nas, Ras Kass, The Pharcyde, Paris...\n\nI've got a lot of hip-hop soundtracks from that period for movies I've never actually watched.",
                "author": "ironfly187",
                "score": 4
            },
            {
                "body": "Agreed but I think the feeling was mutual for both Zoe and him. He was on record (a couple times) saying she was his celeb crush. Her ex replaced her immediately with a 25 year old IG yacht girl that he fully moved in less than 3 months after they broke up so right around the time she popped up with Noah so I think it was a proper rebound with no plans to try to keep it going.",
                "author": "AdventurousBet5128",
                "score": 7
            },
            {
                "body": "It was a bunch of men who encouraged eachother to act like complete animals. ",
                "author": "Bitter_Kangaroo2616",
                "score": 1
            },
            {
                "body": "I mean, the character from an East African kingdom is named *Elena*, and she's blue-eyed and naturally has white hair. Her brother *Marcus* is the same. Capcom kinda suck at these things sometimes. Also, they didn't want to make her a man because that meant they'd have to make him 'stern' or whatever stereotype they decided on for African men.",
                "author": "LichQueenBarbie",
                "score": 2
            },
            {
                "body": "You are such a comedi-hen",
                "author": "justmeraw",
                "score": 54
            },
            {
                "body": "that sounds far more appealing, it’s basically a milkshake",
                "author": "CategorySad6121",
                "score": 45
            },
            {
                "body": "Ok, I remember when she said that she also said eating that food was her “first experience” with depression. And I’m like 😦…weren’t you…like…maybe depressed when your own mother had to kill your abusive father? With a gun? Is melted down ice cream worse than that?!",
                "author": "CatofKipling",
                "score": -14
            },
            {
                "body": "My lips would be bleeding! They are the first to tell me I need water",
                "author": "Bitter_Kangaroo2616",
                "score": 6
            },
            {
                "body": "I heard on a podcast, I want to say Mike Isrataeli (?) that they can't admit because of legal reasons. In some parts of the US these substances are illegal so they can't outright  say it.",
                "author": "nouvelle_tete",
                "score": 25
            },
            {
                "body": "Bodybuilders go all the way crazy with their dehydration and pumps, so comparing them to an actor is a bit of a false equivalence",
                "author": "sabhall12",
                "score": 3
            },
            {
                "body": " I had no idea but I also don’t follow WWE, whereas I had known who The Rock and John Cena were before they had movie careers.",
                "author": "Dry-Yak5277",
                "score": 0
            },
            {
                "body": "Is Cody known beyond the wrestling community though?",
                "author": "Far_Echidna_9333",
                "score": 3
            },
            {
                "body": "I believe his kids were fans of the game and wanted him to take the role.",
                "author": "Drachen1065",
                "score": 6
            },
            {
                "body": "Jfc",
                "author": "Historical-Figure875",
                "score": 1
            },
            {
                "body": "Maybe because she didn’t want to turn such a traumatic experience into movie promo fodder? Seems a bit weird to judge a celebrity for not publicly acknowledging how this event wasn’t depressing for her?",
                "author": "lefrench75",
                "score": 25
            },
            {
                "body": "Oh, I don't expect them to admit it. But I'm not sure why we have to pretend these men just got super dedicated for 4 weeks and completely changed their body types.",
                "author": "amara90",
                "score": 32
            },
            {
                "body": "Mike Israetel (Renaissance Periodization on YouTube) is the man.\n\n\nIt's two things - one is the legality, two is the image of being a juicer.\n\n\nPeople think you have to look like prime Ronnie Coleman to be on the juice. You don't, it just really helps getting shredded and muscular in a shorter period of time.\n\n\nAdd in a private chef, shoppers and assistants, and bespoke personal trainers and you too can transform your physique in 2 months.",
                "author": "meatbeernweed",
                "score": 5
            },
            {
                "body": "Exactly. Noah isn’t obviously dehydrated in this pic he’s just very lean",
                "author": "Pristine-Warthog-320",
                "score": 0
            },
            {
                "body": "iirc Bob Hoskins gave the same reason for doing Super Mario Bros 😅",
                "author": "ace-destrier",
                "score": 7
            },
            {
                "body": "Not going to lie, unironically love that film.",
                "author": "LizzyFCB",
                "score": 4
            },
            {
                "body": "(same)",
                "author": "ace-destrier",
                "score": 5
            }
        ]
    },
    {
        "title": "Lil Nas X Charged with 4 Felonies, Assaulting Cops with Injury",
        "content": "",
        "author": "cmaia1503",
        "score": 236,
        "url": "https://www.reddit.com/gallery/1mzwj86",
        "created_utc": 1756142115.0,
        "comments": [
            {
                "body": "&nbsp;\n\n&nbsp;\n&nbsp;✨🍯 **[JOIN THE FAUXHIVE](https://www.reddit.com/r/Fauxmoi/)** \n&nbsp;\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐝 **[APPLY TO BEE A MOD](https://forms.gle/q6pahnN4SbJTfatL9)**    \n                       \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🌺 **[MAKE REDDIT PINK AGAIN](https://www.reddit.com/r/Fauxmoi/wiki/index/pink/)**    \n            \n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n🐦‍🔥 **[JOIN OUR FIRESIDE CHATS](https://www.reddit.com/r/Fauxmoi/?f=flair_name%3A%22FREE-FOR-ALL%22)**\n\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\n☘️ **[ENTER OUR POP CULTURE BINGO](https://www.reddit.com/r/Fauxmoi/comments/1h62mch/2025_pop_culture_predictions_bingo)**      \n&nbsp;",
                "author": "rfauxmoi",
                "score": 1
            },
            {
                "body": "4 Felonies seems like a bit much. I hope he gets the support he needs during his mental health crisis.",
                "author": "xxSadie",
                "score": 806
            },
            {
                "body": "It’s so predatory that TMZ keeps video of this up, but they’ve been gross forever. Also it’s not lost on me that so many people like Dump get away with so much legally, but I doubt Nas will get the same grace. ",
                "author": "Heavy_Sand5228",
                "score": 439
            },
            {
                "body": "This is why I hated the \"publicity stunt\" comments that came when it first happened. Nothing about this, especially the police involvement, said \"publicity\". I genuinely hope he gets the help he needs.",
                "author": "blissandnihilism",
                "score": 106
            },
            {
                "body": "https://preview.redd.it/5ezpyyt7l7lf1.jpeg?width=307&format=pjpg&auto=webp&s=6e5f4313d90e33b6cf4b437d59b73489b07c89ac\n\nHow the police carry Morgan Wallen to the station before they take selfies with him & let him go.",
                "author": "belai437",
                "score": 219
            },
            {
                "body": "A 165 pound man gone off that Molly injured three cops to a felonious degree by charging at them. Ok.",
                "author": "namegamenoshame",
                "score": 284
            },
            {
                "body": "Cops lie about everything so im not gonna believe anything until we hear his side of the story.",
                "author": "Dizzy_Thought_3293",
                "score": 1428
            },
            {
                "body": "I don’t think this would be the same headline if this was a white gay man",
                "author": "Financial-Painter689",
                "score": 1022
            },
            {
                "body": "Fuck the LAPD. I hope Lil Nas X is getting the help he needs.",
                "author": "HerRoyalRedness",
                "score": 197
            },
            {
                "body": "I dont know what hes going through, but I hope he has the support he needs.",
                "author": "None",
                "score": 75
            },
            {
                "body": "The LAPD's budget is over $1.7 BILLION annually. They should be embarrassed of themselves.",
                "author": "bookwormaesthetic",
                "score": 210
            },
            {
                "body": "I’ve never heard of any other partying celebrity get hit with these kind of charges when being reckless and we all know why.",
                "author": "Cultural_Iron2372",
                "score": 68
            },
            {
                "body": "Is he Bruce Lee how did he injure 4 cops by himself lmao",
                "author": "NoInstructio3",
                "score": 71
            },
            {
                "body": "I hope he gets the help he needs. I do have to wonder how his charges would have played out if he wasn’t a gay, black man, but I hope Lil Nas X has a good support system in place. He always seemed like a good guy.",
                "author": "Sleepy-Giraffe947",
                "score": 119
            },
            {
                "body": "so sad he clearly needs mental health support , i hate that these photos exist",
                "author": "babooshka9302920",
                "score": 54
            },
            {
                "body": "He overpowered three cops in full gear by himself?",
                "author": "pbmm1",
                "score": 57
            },
            {
                "body": "Yeah a cop was \"attacked and injured\" with a subway footlong too. Not believing shit they say until we have actual information.",
                "author": "TheMandarinsToeRing",
                "score": 26
            },
            {
                "body": "Fuck the police, they would not be doing this over a straight white celeb. 3 people injured from one person charging them? Sounds like a them issue. And fuck tmz everyone there is an absolute ghoul and I hope hell is real just to char them.",
                "author": "Bleuberries6",
                "score": 40
            },
            {
                "body": "I don't care, I won't trust the police. I trust them even less when it concerns a black gay man. A lot of celebrities have done worse than this in 4K and the medias didn't even bother.",
                "author": "Thmsthms_",
                "score": 25
            },
            {
                "body": "Calling the police never deescalates the situation.",
                "author": "Relevant-Peach3997",
                "score": 22
            },
            {
                "body": "If he was high on drugs, and someone had called for mental health services rather than the cops, he wouldn’t be in jail. It’s ridiculous that we keep calling cops for things like this when they then escalate situations and people end up in prison as a result.",
                "author": "theprettynerdie",
                "score": 20
            },
            {
                "body": "Four felonies?! Like c'mon now. That's excessive.",
                "author": "cocopuffK221",
                "score": 15
            },
            {
                "body": "A drunk guy on the street with no weapons managed to injure 4 cops? He has the presumption of innocence so I’m going to assume they’re lying until proven otherwise.",
                "author": "rirski",
                "score": 17
            },
            {
                "body": "Someone clearly having a mental health crisis and their first reaction is to send him to jail for life.\n\nNot to get too crazy with left vs right but aren’t right wingers always saying gun violence is a mental health issue? Why not apply that logic here, when Nas is very clearly not being himself.",
                "author": "ClackersJr",
                "score": 20
            },
            {
                "body": "Yeah I don’t care what they say, I support him.",
                "author": "dannemora_dream",
                "score": 19
            },
            {
                "body": "Meanwhile child predators get a slap on the wrist.",
                "author": "bredditmh",
                "score": 16
            },
            {
                "body": "ACAB! He likely needed hospital care not jail. This is awful 😖",
                "author": "Intelligent_Pass2540",
                "score": 15
            },
            {
                "body": "Fuck the police.\nFree Lil Nas X",
                "author": "knittievickie",
                "score": 9
            },
            {
                "body": "This is just so horrible that they’d even publishing the photos of him like this. Do we know if someone drugged him and HE was the victim? Where are his PR people? Manager? Agent?? Like wtf. ",
                "author": "Glittering_Sun_1622",
                "score": 10
            },
            {
                "body": "FTP always",
                "author": "UncircumciseMe",
                "score": 10
            },
            {
                "body": "https://preview.redd.it/5yvgjorjn7lf1.png?width=318&format=png&auto=webp&s=6440c227dc2b204fd33cafdbbd0dc7a2cb4c5d08",
                "author": "Takkotah",
                "score": 5
            },
            {
                "body": "It’s so gross that the video exists and is being shared. The charges are egregious and I’m glad that he was able to have lived through a mental health episode with police involvement as a black person and survived. I’m not sure if website posting is allowed but dontcallthepolice.com is a great resource for alternatives to call if you find yourself in a situation where you see someone having a mental health episode that can provide them help without getting cops involved.",
                "author": "kt_gaga",
                "score": 4
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": 11
            },
            {
                "body": "I hope he gets the help and attention he needs. I don't believe shit the cops say about anything.",
                "author": "lavenderbl0d",
                "score": 6
            },
            {
                "body": "I really hate the way the article frames things. It just feels exploitative and cynical which is par for the course for TMZ",
                "author": "2TrucksHoldingHands",
                "score": 5
            },
            {
                "body": "ACAB",
                "author": "thelauralamb",
                "score": 6
            },
            {
                "body": "This scrawny man injured 3 cops? I don’t buy it tbh",
                "author": "chilli12345",
                "score": 6
            },
            {
                "body": "I hope he can get bail soon. Free lil nas!! \n\nI hope he can get some help and work through whatever's going on and can get lesser charges and sentence. I love him sm and am always rooting for him",
                "author": "ResponsibleCulture43",
                "score": 5
            },
            {
                "body": "how likely are these charges to stick? he clearly wasn’t in his right mind at the time.",
                "author": "cozyhellfire",
                "score": 3
            },
            {
                "body": "I hope he’s ok. If he was having a mental health crisis or was high, police are not trained for that and they don’t care. They make situations like this worse or deadly. :(",
                "author": "EvenPossible5918",
                "score": 2
            },
            {
                "body": "This story is so upsetting to me. I feel like they are trying to make an example out of him. It gave me the same feeling when I saw the way they treated Meg in the street after she got shot. Idk they don’t care about us fr it can get to a nigga damn",
                "author": "Sad_Constant_9698",
                "score": 1
            },
            {
                "body": "Did they even show proof?",
                "author": "House-Business",
                "score": 1
            },
            {
                "body": "I hope he’s okay.",
                "author": "abutteredcat",
                "score": 1
            },
            {
                "body": "I'm throroughly enjoying people not buying into sensationalist media headlines anymore. Everything is twisted and framed to fit one narrative and we're increasingly seeing straight out lies so yeah fuck out of here with that shit",
                "author": "catandthefiddler",
                "score": 1
            },
            {
                "body": "Is there any of this that isn't just \"cops had feelings\"",
                "author": "damiannereddits",
                "score": 1
            },
            {
                "body": "Wtf is going on.",
                "author": "arschl_cher",
                "score": 1
            },
            {
                "body": "The charges seem like overkill. I want to see a bodycam of what happened but I know it's unlikely to happen. I feel bad for him. He doesn't look dangerous, he looks unwell",
                "author": "mauvebirdie",
                "score": 1
            },
            {
                "body": "This does not make me think any less of him actually. Does make me think less of everyone involved who made videos before helping him….",
                "author": "GuaranteeUpper2653",
                "score": 1
            },
            {
                "body": "Free him tbh",
                "author": "okayfineyah",
                "score": 1
            },
            {
                "body": "Fuck the police, free my boy Montero",
                "author": "morvis343",
                "score": 1
            },
            {
                "body": "Ain’t no way I’m ever believing the narrative the LAPD puts out.",
                "author": "violetferns",
                "score": 0
            },
            {
                "body": "Why is there so much footage of this?",
                "author": "nemo987",
                "score": 0
            },
            {
                "body": "Not buying this for a second, justice for my baby!!",
                "author": "Specific_Sweet3312",
                "score": -3
            },
            {
                "body": "In a normal country he would be treated as a vulnerable person experiencing both mental and physical distress. I know this because friends of mine have wandered out of the cemsex party in similar states and we're treated very compassionately by the police who found them. \n\nUnfortunately the US criminal justice system is based upon charging black people with as many crimes as possible in order to send them to prison so that their labour can be exploited.",
                "author": "Maester_Bates",
                "score": -2
            },
            {
                "body": "Ummmm...they saying he injured 3 officers?\nWhile he was naked? ....\n\n\n.sounds like their masculinity was hurt..",
                "author": "FuggyGlasses",
                "score": -5
            },
            {
                "body": "Yeah, I want to see how a bunch of armed cops were afraid of a 6’4” 140lb man in tightie whities and cowboy boots. I want to see the report and the video because I don’t believe that.",
                "author": "thewharfartscenter_",
                "score": -1
            },
            {
                "body": "Oof. Hope no one was seriously hurt.",
                "author": "Steve-Lurkel",
                "score": -28
            },
            {
                "body": "Lol. They just want his money. These cops are a joke.",
                "author": "Nervous_Wreck008",
                "score": -3
            },
            {
                "body": "FUCK OUTTA HERE WITH THIS…\n\nI’d say that any “assault” that took place consisted of LNX rolling his eyes when he noticed some 🐽 around.",
                "author": "Cutieq85",
                "score": -5
            },
            {
                "body": "no way this real, looks like someone just slapped a TMZ logo on a meme generator",
                "author": "wanderingladyy",
                "score": -28
            },
            {
                "body": "Also sounds like those officers are looking for a pay day after this. \n\n>He charged the cops and presumably injured 3 of them.",
                "author": "Dustys_Rotten_Tooth",
                "score": 269
            },
            {
                "body": "Yup. Criminalizing mental health crises, instead of treating them, is yet another example of why this country is a hellhole.",
                "author": "Camilalvrz",
                "score": 78
            },
            {
                "body": "Agreed",
                "author": "BoysenberrySevere224",
                "score": 27
            },
            {
                "body": "Probably not a person that deserves grace but I seen a video of how fast TMZ dropped the Hulk Hogan death report on their socials, filmed in realtime in their own bullpen with the one guy calling the shots. They are so shameless.",
                "author": "Naharke31",
                "score": 37
            },
            {
                "body": "also he was naked and disoriented. like the math aint mathing fr. ",
                "author": "Glittering_Sun_1622",
                "score": 159
            },
            {
                "body": "Nowhere in the article does it specify the type of injury Nas inflicted on the officers. So it’s entirely possible that the injuries were emotional rather than physical. My theory is that either one or both of the following happened:\n\n\n&nbsp;\n\n\n\n1) Nas, in spite of being in an inebriated state, read each of the officers for filth one at a time, inflicting 2d4 Psychic damage on each of them and the ~~pigs~~ officers having extremely low WIS failed their saving throws and also being that cops are weak to psychic damage the damage they received was **DOUBLED**.\n\n2) Being forced to gaze upon a nearly/fully naked Lil Nas, the officers were made to feel incredibly self-conscious about their bodies, consequently they each gained the permanent condition ‘Body dysmorphia’ which gave them disadvantage on their attack rolls and -1 to their INT (lowering their INT stat to zero).\n\n\n&nbsp;\n\n\n>!this is a joke!<",
                "author": "Just_Alive_IG",
                "score": 10
            },
            {
                "body": "Right?? He was in his underwear and cowboy boots and injured three armed officers? Like what?",
                "author": "WriterOfAll",
                "score": 24
            },
            {
                "body": "Crystal meth powers.",
                "author": "Chapel_Hillbilly",
                "score": -61
            },
            {
                "body": "https://preview.redd.it/v8pty97wk7lf1.jpeg?width=645&format=pjpg&auto=webp&s=509be917ff4f73746a300f61b5ba2fd098edefb2\n\nThis was the original press release for George Floyd before the cell phone recordings came out.",
                "author": "piptazparty",
                "score": 799
            },
            {
                "body": "Not to mention, it’s lil nas x. I’m taller than him and even if I weren’t if I had a tazer or gun I’d be totally relaxed. \n\nHe assaulted them with his gayness and blackness.",
                "author": "Wonderful_Gap1374",
                "score": 56
            },
            {
                "body": "That part.",
                "author": "FancyKerrigan",
                "score": 6
            },
            {
                "body": "No lies detected. I am glad he is famous and is still alive.",
                "author": "moreKEYTAR",
                "score": 275
            },
            {
                "body": "Someone else said if it was a straight white man they be getting a Calvin Klein deal by next week.",
                "author": "Flimsy_Situation_506",
                "score": 133
            },
            {
                "body": "☝️",
                "author": "blahblahnumbers",
                "score": 2
            },
            {
                "body": "Im not saying he did injure anyone, because I can 100% believe that the cops are lying to get a payday, but lets not underestimate the strength of someone not in their right state of mind. It seems plausible to me that theyre completelt lying but it also seems plausible that someone having extreme mental health issues could injure people trying to subdue them, especially if the cops actually were (this is hypothetical) trying not to injure him. \n\nI dont think the people here saying theres no way he could have hurt anyone have ever tried to restrain someone in that kind of state, but it is very very difficult to do without anyone getting hurt.",
                "author": "Acheloma",
                "score": 18
            },
            {
                "body": "I once saw a guy, smaller than Nas, get violent in a hospital ER area. Took eight to restrain him and get him strapped in a gurney. It can happen.",
                "author": "Lucky-Chard-5587",
                "score": 25
            },
            {
                "body": "Idk how it works in the states but in Australia you don’t really have a straight up mental health line and if they do attend (CAT team) they will not attend without police presence. ",
                "author": "wizards_rule94",
                "score": 2
            },
            {
                "body": "They took him to a hospital first but they can sentence him to any sort of facility without trying him first. What do you want them to do?",
                "author": "Lloydlcoe02",
                "score": 3
            },
            {
                "body": "An ultra drunk man managed to injure THREE sober police officers? Right.",
                "author": "imaginary92",
                "score": 432
            },
            {
                "body": "I don’t consume their stuff but I will give them credit for the accuracy of the articles I do see from them on Reddit/fb. For real, they are scummy and disgusting but fuck if they don’t do their research (or, more likely, they pay their sources well enough to give accurate facts)",
                "author": "MiserableFckingCunt",
                "score": 9
            },
            {
                "body": "As a DM, this math checks out. They were unable to handle a bard of his caliber",
                "author": "xxSadie",
                "score": 1
            },
            {
                "body": "Just going to leave this sentence here. \"Body cameras were on and activated during the incident\"\n\nhttps://preview.redd.it/kdrcal4458lf1.jpeg?width=474&format=pjpg&auto=webp&s=4eff215a571f8b69459f2f3acfd1c750822de2fb",
                "author": "West_Translator_9829",
                "score": 223
            },
            {
                "body": "It’s always a “medical incident”. (That’s what they call it when they do something that makes your heart permanently stop beating)",
                "author": "waxybasketball",
                "score": 92
            },
            {
                "body": "Thank you for doing this. Very sincerely, it gives me some hope that your comment and the parent comment are the top ones in this thread. ♥️",
                "author": "HistoricalSuspect580",
                "score": 27
            },
            {
                "body": "disgusting.",
                "author": "i_boop_cat_noses",
                "score": 8
            },
            {
                "body": "People in these comments clearly do not have experience dealing with folks not in their right mind. Humans are capable of doing a lot of damage to themselves and others when theyre not thinking logically. I could totally see the cops lying, but its also completely believable that he did injure people.",
                "author": "Acheloma",
                "score": 25
            },
            {
                "body": "Look, those officers feared for their lives okay. It's a miracle they held it together enough to not shoot anyone. \n\nOnly half joking btw, I'm glad Nas seemingly wasn't beaten or anything despite \"resisting arrest\"",
                "author": "Talinia",
                "score": 119
            },
            {
                "body": "Right? Smells like a load of BS to me. Especially considering how uncoordinated and unclothed the poor man was. I have a hard time buying he did enough to warrant these charges.",
                "author": "xxSadie",
                "score": 37
            },
            {
                "body": "If that was Lil Nas drunk…. He was BORN for the catwalk.",
                "author": "HistoricalSuspect580",
                "score": 4
            },
            {
                "body": "My GOAT",
                "author": "HamsLlyod",
                "score": 3
            },
            {
                "body": "I once was a sitter for an older lady with dementia. She beat me *up*. I'm not small or weak, and I'd go home covered in bruises.",
                "author": "KTKittentoes",
                "score": 2
            },
            {
                "body": "Yeah it's surprising that *they* didn't injure *him* honestly. Well, as far as we know at least.\n\nI hope he's safe and he is able to get out of this situation and get whatever help he may need.",
                "author": "imaginary92",
                "score": 15
            },
            {
                "body": "It wouldn’t shock me if it was somehow a friendly fire incident (like the cop that shot his partner while he was aiming at the dog biting her)\n\nWho knows they might also be angling for some PTO",
                "author": "CroCGod73",
                "score": 2
            }
        ]
    },
    {
        "title": "Lil Nas X Charged with 4 Felonies, Assaulting Cops with Injury",
        "content": "",
        "author": "cmaia1503",
        "score": 2715,
        "url": "https://www.tmz.com/2025/08/25/lil-nas-x-charged-four-felonies-assaulting-cop-nearly-naked-walk/?adid=social-tw",
        "created_utc": 1756141886.0,
        "comments": [
            {
                "body": ">Lil Nas X is now facing years in prison ... because the L.A. County District Attorney has charged him with 4 felonies ... including battery with injury on a police officer.\n\n\n\n>TMZ broke the story ... the \"Old Town Road\" rapper was naked on Ventura Blvd. in the San Fernando Valley when cops were called. They say when they confronted him, he charged the officers ... and presumably injured at least 3 of them -- hence the 3 felony charges.\n\n\n\n>Nas was also hit with a felony charge of resisting an executive officer -- i.e., a cop.\n\n\n\n>The rapper was held without bail over the weekend until he could appear before a judge, which happened Monday morning.\n\n\n\n>He's set to be arraigned later today. So far, bail has not been set, but that should happen when he's arraigned.",
                "author": "cmaia1503",
                "score": 578
            },
            {
                "body": "I legitimately thought he was filming a music video when I saw the clip of him walking down the street in his tightey-whiteys.",
                "author": "UnpricedToaster",
                "score": 109
            },
            {
                "body": "He's not the first famous person to get naked on the street in California, nor the first to abuse cops.  This is not a Hollywood deal breaker.",
                "author": "HoraceRadish",
                "score": 430
            },
            {
                "body": "30 more felonies and he qualifies to lead our nation.",
                "author": "chamberx2",
                "score": 146
            },
            {
                "body": "Wait THREE cops can't handle ONE twink lol",
                "author": "Hot_Secretary2665",
                "score": 395
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": 48
            },
            {
                "body": "Drugs and likely underlying psychiatric issues aren’t a great combination.",
                "author": "BigJakeMcCandles",
                "score": 21
            },
            {
                "body": "Release the body cam footage. He doesn’t strike me as someone who will stay quiet and LAPD isn’t one to avoid a good scandal. This is gonna be an interesting ride.",
                "author": "BrushRight",
                "score": 108
            },
            {
                "body": "Usually I'm all for new boot goofin but not for 4 felonies",
                "author": "explainingjane",
                "score": 94
            },
            {
                "body": "He charged at them to cause injuries?  Sounds like he was going to ride till he can’t no mo’.",
                "author": "WeirdSysAdmin",
                "score": 69
            },
            {
                "body": "Ok so what about the famous guys son that literally almost killed that wrestler? X was just high as shit.",
                "author": "JROCC_CA",
                "score": 8
            },
            {
                "body": "My bad, I'd only seen the naked cowboy edition and was pissed they were giving him shit.",
                "author": "Cross_Eyed_Hustler",
                "score": 8
            },
            {
                "body": "Jesus?? The fact that this dude has been dogging us for so long he STILL got some of us questioning if it's real.. I really hope he gets some help. Treating all of your traumas with humour (and drugs) eventually catches up to you.",
                "author": "evaporatedtwizzler",
                "score": 37
            },
            {
                "body": "Mental breaks happen. I was hauled off in an ambulance. Put in a place that I didn’t belong in bc my psychosis was not detox.",
                "author": "Dorkinfo",
                "score": 7
            },
            {
                "body": "So this is what happened:\n\nHe did all this as a publicity stunt and he thought that getting into a little confrontation with the police would result in a slap on the wrist/small fine. It didn't.",
                "author": "blff266697",
                "score": 4
            },
            {
                "body": "I believe absolutely NOTHING a cop says without body cam footage.  zero.",
                "author": "redditdoesnotcareany",
                "score": 21
            },
            {
                "body": "I watched the clip. Looks like a combination or drugs and starving for attention",
                "author": "Desperate-Cookie-449",
                "score": 24
            },
            {
                "body": "I mean, if true ok...but a naked guy injured 3 officers?",
                "author": "Signal_Nobody1792",
                "score": 30
            },
            {
                "body": "Well. Mental illness.",
                "author": "OldZaxSauce",
                "score": 3
            },
            {
                "body": "I was a fan but now I stan",
                "author": "4204666",
                "score": 7
            },
            {
                "body": "Poor thing. Ugh.",
                "author": "Pale_Pumpkin_9873",
                "score": 16
            },
            {
                "body": "POLICE SHOULD NOT RESPOND TO NON-VIOLENT SITUATIONS. Maybe idk, trained mental health professionals to check in and that know how to deescalate if it’s required?\n\nOn a more important note. I don’t see anything wrong in this video at least. Homeboy drunk / turnt up on a walk. He’s flamboyant so of course he’s dressed like that but doesn’t change the fact that most people been in a drunken/lit stoop before. Just not with the world’s eyes on them.\n\nFuck these felony charges. Pure theater.",
                "author": "Sweet_Matter2219",
                "score": 10
            },
            {
                "body": "Cops scared of a naked black man is consistent",
                "author": "SlashOfLife5296",
                "score": 13
            },
            {
                "body": "He attacked an injured cop or injured a cop? Unclear lmao",
                "author": "Potential_Ice4388",
                "score": 2
            },
            {
                "body": "I hope the kid will be okay. He used to have fun instagram posts",
                "author": "charlieyeswecan",
                "score": 2
            },
            {
                "body": "I love all the comments saying he can’t possibly be strong enough to fight cause he’s gay.",
                "author": "wipjakblak",
                "score": 2
            },
            {
                "body": "Ain’t no way he injured a cop let alone 3! This is a joke…right?!?",
                "author": "treefall1n",
                "score": 4
            },
            {
                "body": "LAPD is corrupt AF. I’d be willing to bet they charged him because he has money and they can sue him later",
                "author": "IcedHemp77",
                "score": 2
            },
            {
                "body": "Fuck the police",
                "author": "Cjvann123",
                "score": 1
            },
            {
                "body": "He should run for president",
                "author": "Few_Resort1952",
                "score": 1
            },
            {
                "body": "Fuck the police. \n\nGet that Lil Nas X some counseling and support. \n\nFuck the police.",
                "author": "Goofalo",
                "score": -8
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": 1
            },
            {
                "body": "Something doesn’t smell right with this…",
                "author": "No-Scar8782",
                "score": 1
            },
            {
                "body": "I’m just kinda glad he isn’t in the hospital or worse?\n\nEdit: AND WHERE WERE HIS HANDLERS?!",
                "author": "UndeadYoshi420",
                "score": 1
            },
            {
                "body": "Take cover! It’s a flying anaconda!",
                "author": "ReindeerNo7072",
                "score": 1
            },
            {
                "body": "Louis Pisano posted a great blurb about it, I just have to wonder how this would’ve gone down if it were, say, Troy’s Sivan instead…. Just saying",
                "author": "Relevant-Bench5307",
                "score": 1
            },
            {
                "body": "I forgot he still exist",
                "author": "orgdlm",
                "score": 1
            },
            {
                "body": "A lot of times the felony charges against the cops get dropped in exchange for a plea. Let’s hope he can plea out and get help.",
                "author": "Bustedtelevision",
                "score": 1
            },
            {
                "body": "He should be charged. If he was just having a mental health crisis I don’t think he should be charged. The fact that he overdosed means he was on drugs and should be responsible for the consequences of his actions.",
                "author": "ActPositively",
                "score": 1
            },
            {
                "body": "Feel bad for him! Reminds me of my older gay brother. He can’t quit the meth and sketchy behavior I pray they find him walking down the street naked and not dead in a ditch.",
                "author": "purplelephant",
                "score": 1
            },
            {
                "body": "What a fucking idiot.  Not surprising that the great minds of reddit see nothing wrong with a dude walking around naked in public",
                "author": "LumpyGibbon",
                "score": 1
            },
            {
                "body": "Most dumb thing. Did they charge others with crimes? He was walking down a street blitzed off his mind. Im sure if he was white he would be charged with jus public intoxication.",
                "author": "derrico89",
                "score": 1
            },
            {
                "body": "They are going to be passing him around for a brand new iPhone in jail hooooly!",
                "author": "KikiBumSqueaky",
                "score": 1
            },
            {
                "body": "Sometimes it seems charges like this are brought forward as an incentive to cut some type of deal requiring the person charged to go to treatment. I’m hoping that’s the case here, because he needs help.",
                "author": "oklutz",
                "score": 1
            },
            {
                "body": "Him and Kodak black, I swear.",
                "author": "NobleAssassin96",
                "score": 1
            },
            {
                "body": "Should have been mental health experts more than cops",
                "author": "Julz5664_1111",
                "score": 1
            },
            {
                "body": "He’s ready for politics now lol",
                "author": "Flashgas",
                "score": 0
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": -1
            },
            {
                "body": "He bout to be a menace in jail.... Booty Warrior 2.0",
                "author": "Dolomitexp",
                "score": -1
            },
            {
                "body": "This guy needs therapy badly.  It's a shame that He probably won't get it.  He has the money for the best medical care money can buy but won't get it.",
                "author": "swift110",
                "score": 1
            },
            {
                "body": "He's rich, he'll be fine",
                "author": "Albebak4546",
                "score": 1
            },
            {
                "body": "Oh what a coincidence, some controversy just before his new album. Oh is definetely not a coincidence lol",
                "author": "dalposenrico01",
                "score": 1
            },
            {
                "body": "Rappers and controversy do go well together.",
                "author": "General_Yt",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": -1
            },
            {
                "body": "I hate that cops get special protections.",
                "author": "lumpy999",
                "score": -2
            },
            {
                "body": "What a shit police system we have. The idiot that called the cops, why? You could have made bank and a new friend.",
                "author": "vDebsLuthen",
                "score": -7
            },
            {
                "body": "FUCK THE PIGS, FREE LIL NAS X",
                "author": "heavymetalhikikomori",
                "score": -4
            },
            {
                "body": "He probably gave them all compliments and made some of those men question themselves and out of pure hatred for themselves accused Nas of assault. Body camera footage or he’s innocent. Point. Blank. Period.",
                "author": "Kkwoowoo",
                "score": -3
            },
            {
                "body": "They should have charged him with 5 felonies. The 5th for assaulting my ear drums with the song Star Walkin",
                "author": "DigbickMcBalls",
                "score": 0
            },
            {
                "body": "Prime example of do stupid shit, win stupid prizes. ",
                "author": "Robynsxx",
                "score": 0
            },
            {
                "body": "I still think this is a publicity stunt",
                "author": "ItssHarrison",
                "score": -7
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": -9
            },
            {
                "body": "Ohhh man he’s going to be going down to the old country road with the prison boys",
                "author": "jreid0",
                "score": -1
            },
            {
                "body": "I guess Hollywood is done glamorizing him?",
                "author": "Standard-Victory-320",
                "score": -2
            },
            {
                "body": "Shouldn't get bail with violent crime.\nReleasing known violent criminals to repeat their crimes is crazy. \n\n\nViolent offenders should get much harsher punishments than they currently do.",
                "author": "theslack",
                "score": -12
            },
            {
                "body": "Play stupid games you win stupid prizes. Maybe an extensive jail stat will do good for him and for the music industry.",
                "author": "Grizzack",
                "score": -1
            },
            {
                "body": "Black and Gay! They are sending his ass to prison. Some don’t believe the stove is hot until they touch it! Does he not have a single friend that would tell him this was a bad idea in the current political environment!",
                "author": "Imyoteacher",
                "score": -4
            },
            {
                "body": "**”Now I’ll do some tootin now! I’ll do a little tootin, but I will NOT… will NOT freebase cocaine.”**",
                "author": "ihavezeroanswersbro",
                "score": 0
            },
            {
                "body": "b**** im bill bellamy",
                "author": "Accomplished-Nail263",
                "score": 0
            },
            {
                "body": "You sure it wasn't Tracy Jordan?",
                "author": "FdgPgn",
                "score": 0
            },
            {
                "body": "Might be the best crash out since the KONY guy",
                "author": "pm_me_your_passw0d",
                "score": 0
            },
            {
                "body": "humiliation ritual complete",
                "author": "ezra_c03",
                "score": 0
            },
            {
                "body": "Can I call complete bullshit on this. Where’s the footage? There’s no footage at all so some person in the beginning just filmed him walking in Studio city in front of Granville mind you and that’s it and supposedly he walked all the way down from Granville Studio city to Lankershim, where Universal Studios is and there’s only footage from the beginning of his walk yeah sure. And now all of a sudden they haven’t seen any results of his drug test cause he was never in the hospital never had the OD after all so that was a lie. Also, he charged the cops. Where’s the where’s the footage? Bullshit",
                "author": "Inevitable-Change543",
                "score": 0
            },
            {
                "body": "So, being black and rich helps you get away with murder, but as soon you're not a straight rich black man, you can't get away with being drunk in public. Seems homophobic.",
                "author": "PhD_Pwnology",
                "score": -36
            },
            {
                "body": "La county district attorney is now charging black men with crimes lol what’s next charging illegal immigrants with crimes",
                "author": "EnvironmentalFly3194",
                "score": -1
            },
            {
                "body": "Found the [body cam footage](https://youtu.be/yVBwPNKvFMY?si=84UI070tEoInlV-d)",
                "author": "WholeKaleidoscope556",
                "score": -1
            },
            {
                "body": "Ive seen what happens when he is in a prison",
                "author": "3HaDeS3",
                "score": -1
            },
            {
                "body": "Naked violent drug induced menace to society black man good. Police officer racist. police officer bad",
                "author": "Daddychellz",
                "score": -8
            },
            {
                "body": "at least he will probably like the extracurricular activities in prison",
                "author": "Emergency_Earth_1032",
                "score": -15
            },
            {
                "body": "I want to see the body cam footage for proof",
                "author": "LogicalEgo",
                "score": 1090
            },
            {
                "body": "Naked must mean something different in the USA.  What I saw him wearing was more than our ex prime minister on the beach.  Which would mean no reason for cops so no crime would have allegedly happened.",
                "author": "Pretend-Patience9581",
                "score": 21
            },
            {
                "body": "Why do Hollywood stars always end up buck naked on Hollywood Blvd?! He's not the first and won't be the last....something's going on in Hollywood that is making people do this...or is it just copycat syndrome?",
                "author": "surprise_revalation",
                "score": 34
            },
            {
                "body": "Ridiculous for someone obviously in a mental health crisis",
                "author": "deathbychips2",
                "score": 15
            },
            {
                "body": "4 felonys and he's being threatened with more punishment than Trump ever was.",
                "author": "Astral_Justice",
                "score": 12
            },
            {
                "body": "POLICE SHOULD NOT RESPOND TO NON-VIOLENT MENTAL HEALTH SITUATUONS.\n\nFuck these felony charges.  Pure theater.",
                "author": "Voxlings",
                "score": 39
            },
            {
                "body": "Doesn't seem right to refer to him as \"Nas.\"",
                "author": "Blarg0ist",
                "score": 5
            },
            {
                "body": "I’m glad TMZ explained that an “officer” is the same as a “cop.” I would have been really confused otherwise (ie, I wouldn’t have understood).",
                "author": "Irrelevantitis",
                "score": 4
            },
            {
                "body": "the guy needs help and care, not punishment. fucking human society, we’re just awful.",
                "author": "phoenixhunter",
                "score": 3
            },
            {
                "body": "You guys are so gullible",
                "author": "Inevitable-Change543",
                "score": 1
            },
            {
                "body": "It’s California, he’ll be out with a slap on the wrist in no time",
                "author": "Bingbong2774",
                "score": 1
            },
            {
                "body": "A half naked dude who probably weighs 170lbs soaking wet managed to “injure” 3 cops?\n\nNo chance that sticks.",
                "author": "KendrickBlack502",
                "score": 1
            },
            {
                "body": "Post prison album is gonna be lit",
                "author": "the-skazi",
                "score": 136
            },
            {
                "body": "When I think of someone getting naked in California I can only think of the Kony 2012 guy jackin it in Saaannn Diego",
                "author": "This_Elk_1460",
                "score": 14
            },
            {
                "body": "He wasn’t even naked…",
                "author": "Intrepid-Oil-898",
                "score": 15
            },
            {
                "body": "He’s black and gay. Good luck to him.",
                "author": "thetruth8989",
                "score": 6
            },
            {
                "body": "tbh i’m just glad the title didn’t say what i was expected to see ..:::in these times.",
                "author": "Appsoul",
                "score": 1
            },
            {
                "body": "reddit trying to make literally anything about trump challenge",
                "author": "Fit-Election6102",
                "score": -41
            },
            {
                "body": "As someone who worked in corrections, one dude on drugs can easily match 5+ cops. Seen it countless times. I wanna see the bodycam though to see what really went down",
                "author": "GrandmasterHeroin",
                "score": 206
            },
            {
                "body": "You think Lil Nas X is a twink? He's built.",
                "author": "EliasFromDetroit",
                "score": 19
            },
            {
                "body": "A 6’2 guy with muscle is a twink now?",
                "author": "WhispersOfHaru",
                "score": 6
            },
            {
                "body": "They were mesmerized by that third leg swinging 😵‍💫",
                "author": "4sk-Render",
                "score": 5
            },
            {
                "body": "This is not how it works in the videos I’ve seen.",
                "author": "randomwanderingsd",
                "score": 1
            },
            {
                "body": "You underestimate the power of the dark side(drugs) of the force…",
                "author": "Enzo_Gorlomi225",
                "score": 1
            },
            {
                "body": "Are you saying LBGTQ+ are stereotypically unable to fight?\n\nEdit: only on reddit would people downvote the person asking the question to the homophobe rather than to the actual homophobe.",
                "author": "gojo96",
                "score": -7
            },
            {
                "body": "Drugs and exhaustion.",
                "author": "FriendshipSlight1916",
                "score": 43
            },
            {
                "body": "The second and then the first",
                "author": "brinz1",
                "score": 11
            },
            {
                "body": "It looked a lot like a manic episode",
                "author": "Large-Flamingo-5128",
                "score": 2
            },
            {
                "body": "Both.  Def mental health crisis dugs almost guaranteed in play",
                "author": "Sasquatch-fu",
                "score": 5
            },
            {
                "body": "Humiliation ritual?",
                "author": "MoldyZebraCake666",
                "score": -39
            },
            {
                "body": "Publicity stunt. Dude's washed, he's gotta keep his name circulating somehow.",
                "author": "DustinnDodgee",
                "score": -1
            },
            {
                "body": "La Zapateria Bailarina must have been doing a BOGO sale or something",
                "author": "B-BoyStance",
                "score": 22
            },
            {
                "body": "No, I think he targeted cops who had injuries.",
                "author": "herefromyoutube",
                "score": 4
            },
            {
                "body": "Does clothing make you stronger or something?",
                "author": "Scaife13",
                "score": 25
            },
            {
                "body": "I don’t understand why that’s hard to believe",
                "author": "thissexypoptart",
                "score": 6
            },
            {
                "body": "High on drugs? Believable.",
                "author": "ctilvolover23",
                "score": 36
            },
            {
                "body": "Ever been kicked with cowboy boots?",
                "author": "BetziBaddie",
                "score": 7
            },
            {
                "body": "Never underestimate the power of a crackhead.",
                "author": "rad0909",
                "score": 4
            },
            {
                "body": "How does being naked prevent you from hurting someone lol?",
                "author": "PastPiano2960",
                "score": 1
            },
            {
                "body": "May I introduce you to [Superman](https://www.youtube.com/watch?v=E-5u45iWzkg)? \n\n(Skip to :53 for the goods)",
                "author": "B-BoyStance",
                "score": -1
            },
            {
                "body": "I really hate to see this and hope he gets help, preferably without going to prison.",
                "author": "thepsycholeech",
                "score": 11
            },
            {
                "body": "Highly recommend you take the time to watch various bodycam videos on YouTube of people in crisis. They can be extremely dangerous and are not of sound mind. A social worker using a soft voice attempting to deescalate is not going to work…",
                "author": "corporatebee",
                "score": 2
            },
            {
                "body": "So… a social worker should have been injured instead of the cops…?",
                "author": "free__coffee",
                "score": -1
            },
            {
                "body": "It was the huge weapon between his legs that scared them lol",
                "author": "4sk-Render",
                "score": -11
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": -2
            },
            {
                "body": "At some point the tighty whiteys came off, there are pictures of him both ways",
                "author": "IcedHemp77",
                "score": 1
            },
            {
                "body": "his 6 ft 2 and clearly built from all the top less pics he takes, dudes in way better shape than most people",
                "author": "ezp252",
                "score": 11
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": -2
            },
            {
                "body": "You might be genuinely stupid",
                "author": "Ok_Dragonfruit_8102",
                "score": 1
            },
            {
                "body": "I can't imagine that he would risk years in jail as a publicity stunt for music that he hasn't even announced yet, AFAIK? The man is great at marketing himself, and he's not an idiot.",
                "author": "sci_fientist",
                "score": 1
            },
            {
                "body": "It’s sad that you’re hating.",
                "author": "EasyCommunication824",
                "score": 5
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": 1
            },
            {
                "body": "Are you comparing a 30 year old legal battle that lasted years to this?",
                "author": "BigXBenz",
                "score": 14
            },
            {
                "body": "Normally I’m with you, but be patient and wait for the BWC footage before saying that’s what’s happened here.",
                "author": "lindsayblohan_2",
                "score": 8
            },
            {
                "body": "Lol what is even this. Yeah I'm sure those cops were thinking,  \"GAY, let's get this ass\" instead of  just doing their job. \n\nThis hasn't even gone to court yet. What a weird post",
                "author": "NoQuartersGiven",
                "score": 16
            },
            {
                "body": "Being black helps you get away with murder…?",
                "author": "Infamous-Manner-4705",
                "score": 10
            },
            {
                "body": "A naked man took out 3 cops in presumably standard body armor and loadout. k.",
                "author": "rumpleminz",
                "score": 553
            },
            {
                "body": "Some cop is gonna have to go on the stand and admit they got their ass whooped by a fabulous man in tighty whities and boots.",
                "author": "South_Oread",
                "score": 23
            },
            {
                "body": "I certainly am not going to take the police's word for it. They lie as they speak. The guy probably did not follow orders and they called it assaulting officers, when resisting arrest would be the most it would have been.",
                "author": "hectorbrydan",
                "score": 295
            },
            {
                "body": "Lol for real. Before the days of body cams I was charged with assault on a peace officer because he tore his parch while tackling me to the ground to wail on my ribs after me asking \"is this a voluntary conversation or am I being lawfully detained?\"\n\nGranted I was hungover as fuck and an early 20s smug fuck in general but still. Cops got them feelings.",
                "author": "Butts_Fartington",
                "score": 94
            },
            {
                "body": "Always ask for body cam footage. Even if your guilty of something else it's easy to get out of made up bullshit that will put you away. ",
                "author": "jcamp088",
                "score": 3
            },
            {
                "body": "Not saying he did do it, but if he was intoxicated with drugs as the reports claim, never underestimate what someone will do while high that they normally wouldn’t",
                "author": "mythic-moldavite",
                "score": 2
            },
            {
                "body": "And for lols",
                "author": "Broken-Digital-Clock",
                "score": 2
            },
            {
                "body": "Me too I got charged for the same shit bc I was drunk and disorderly. If they get pissed enough, they throw the book.",
                "author": "DebraBaetty",
                "score": 1
            },
            {
                "body": "Bro was high as a kite challenging cops and no one got killed. He's lucky he's not dead lol. \n\nHe won't see jail time because he's rich. Do you really want to see his dick flying at the cops that much lmao",
                "author": "Crafty_Cellist_4836",
                "score": 1
            },
            {
                "body": "There was a video of him in only white underwear walking down the road, so that part’s true atleast",
                "author": "Bedsheats",
                "score": 1
            },
            {
                "body": "Exactly cause it never happened just like he was never in the hospital overdosing it was all bull crap even at the courthouse they said he was never at the hospital and has 0 drugs in his system",
                "author": "Inevitable-Change543",
                "score": 1
            },
            {
                "body": "I bet you he lightly pushed them a little while resisting arrest and their egos were absolutely shattered in pieces. I don’t see how the 3 battery charges are going to stick.",
                "author": "CMDR_KingErvin",
                "score": 1
            },
            {
                "body": "lol that’s a trial jury’s role not yours. Not all body cam footage needs to be assessed by the public",
                "author": "CrimsonBrit",
                "score": 0
            },
            {
                "body": "This. All footage I’ve seen he was wearing underwear",
                "author": "maq0r",
                "score": 12
            },
            {
                "body": "apparently, he became naked shortly after",
                "author": "Longjumping_Bar_7457",
                "score": 5
            },
            {
                "body": "There’s video of him completely naked",
                "author": "Large-Flamingo-5128",
                "score": 3
            },
            {
                "body": "real ones wack it in san diego",
                "author": "DJDanielCoolJ",
                "score": 26
            },
            {
                "body": "I think that's where most of the trendy bars/nightclubs in LA are.\n\n\nMakes sense that you'd get a lot of drunk/high people near where most of the places that people get drunk/high are.",
                "author": "vi_sucks",
                "score": 11
            },
            {
                "body": "Because people with cameras are there",
                "author": "blff266697",
                "score": 1
            },
            {
                "body": "He wasn't having a mental health crisis. It was a publicity stunt and he's being punished for using cops to get some TMZ coverage",
                "author": "blff266697",
                "score": -3
            },
            {
                "body": "I mean, who should respond to a naked man thats high and/or drunk going down the street? Especially if we see body cam footage and he did charge them.",
                "author": "Scrollingmaster",
                "score": 2
            },
            {
                "body": "He already has the outfits too",
                "author": "I_AM_IGNIGNOTK",
                "score": 33
            },
            {
                "body": "I wonder if it’s some sort of sacrifice",
                "author": "ihavezeroanswersbro",
                "score": 3
            },
            {
                "body": "And it was in Mission Bay, one of the nicest places in the finest city that is German for \"Whale's Vagina.\"",
                "author": "theaviationhistorian",
                "score": 7
            },
            {
                "body": "For me it's always Martin Lawrence.",
                "author": "HoraceRadish",
                "score": 8
            },
            {
                "body": "Look at the TMZ article..",
                "author": "mariisheartless",
                "score": 2
            },
            {
                "body": "There’s a video of him walking around in cowbow boots in underwear. In the official police report he got naked (no cowboy boots and underwear) and “charged” the officers. Source[https://www.nbcnews.com/news/amp/rcna227048](https://www.nbcnews.com/news/amp/rcna227048)",
                "author": "Impressive-Way-7506",
                "score": 0
            },
            {
                "body": "Sounds like prison will be an all inclusive for him",
                "author": "Dapperrevolutionary",
                "score": -5
            },
            {
                "body": "Most famous felon in America, seems perfectly logical to mention him here",
                "author": "KhanQu3st",
                "score": 26
            },
            {
                "body": "Trumps makes everything about Trump so what do you expect?",
                "author": "No-Scar8782",
                "score": 13
            },
            {
                "body": "Yes, because the double standard plays out *every single day* so you’re going to hear about it until we get tired.",
                "author": "RVAforthewin",
                "score": 4
            },
            {
                "body": "If the President is allowed to commit crimes why shouldn’t lil Nas be allowed? \n\nEither laws matter or they don’t. Right now it seems they don’t. So Nas should go free.",
                "author": "Shigglyboo",
                "score": 1
            },
            {
                "body": "Redditor trying to make another redditor's comment some representation of a monolithic \"reddit\" challenge.",
                "author": "chamberx2",
                "score": 1
            },
            {
                "body": "Worked in law enforcement. Saw a dude high on *all* the PCP break into a transformer field for…reasons only he knew. Tanked an entire shock from a step-down transformer. Took out a city block’s power. Lived. With seemingly little complications? I met him on the street 2 months later still getting high and living rough.\n\nFor others info, this isn’t a minor shock. Guys who flip switches on those things do it with a 12 foot specialty pole and still wear a full insulated protective suit. It was a huge deal to even make safe the transformer area for FD to go in and get him.",
                "author": "BrainDamage2029",
                "score": 51
            },
            {
                "body": "Especially if they’re skinny lmao I currently work at a forensic psych hospital and the skinny patients give us the most trouble",
                "author": "mcc22920",
                "score": 41
            },
            {
                "body": "No, he’s a “twink” so homophobic “allies” have already decided that he is weak to fit a stereotype!",
                "author": "M90Motorway",
                "score": 7
            },
            {
                "body": "If it weren't embarrassing for them they would've already released the footage. Maybe that's an uncharitable assumption but they're welcome to prove me wrong any time by simply releasing the footage",
                "author": "Hot_Secretary2665",
                "score": 17
            },
            {
                "body": "My loved one is incarcerated (drugs, using not dealing) and I visit when I can. I don’t want to be disrespectful, but the guards don’t exactly seem like people in peak physical condition. I’m not super surprised an addict could take out a full Meal Team 6 unit.",
                "author": "Caftancatfan",
                "score": 1
            },
            {
                "body": "Then those cops are shitty cops. Cops have weapons and training. They should be able to take down skinny unarmed men.",
                "author": "squishmallow2399",
                "score": -1
            },
            {
                "body": "They consider anything a twink now, completely meaningless terms at this point.",
                "author": "GenusPoa",
                "score": 1
            },
            {
                "body": "In the past no but in the video TMZ posted he's looking skinny now",
                "author": "Hot_Secretary2665",
                "score": -9
            },
            {
                "body": "No that's a straw man argument you made up in your head",
                "author": "Hot_Secretary2665",
                "score": 7
            },
            {
                "body": "\"Twink\" implies a certain body type, not just a sexual orientation",
                "author": "wallabee_kingpin_",
                "score": 0
            },
            {
                "body": "Most of us humans don’t need that to self destruct.",
                "author": "redsuncircle",
                "score": 8
            },
            {
                "body": "Happy cake day!",
                "author": "ihavezeroanswersbro",
                "score": 2
            },
            {
                "body": "Wait, nudity doesn't make you stronger on this planet?",
                "author": "Ecstatic-Inevitable",
                "score": 7
            },
            {
                "body": "Yeah one of the reasons they are shirtless in UFC is because it would literally put you at a disadvantage - opponents can control you with it",
                "author": "noujest",
                "score": 1
            },
            {
                "body": "Straight up witnessed a dude tank being tased once. Don't know what he was on, but the weird shit is was doing and saying was insane.",
                "author": "Isoturius",
                "score": 13
            },
            {
                "body": "the point is that maybe a social worker *wouldn’t* have been injured because they could’ve spoken to him and helped him and de-escalated the situation; the police responding to this in the way that police respond to things, yelling and pointing guns at this disturbed guy definitely wouldn’t help diffuse the situation.",
                "author": "phoenixhunter",
                "score": 3
            },
            {
                "body": "Yes because then it's violent and then you can bring in the cops",
                "author": "Dapperrevolutionary",
                "score": 0
            },
            {
                "body": "Very american comment",
                "author": "Edit-The-SadParts",
                "score": 4
            },
            {
                "body": "Penis obsession; racial stereotype.",
                "author": "Neither_Cut2973",
                "score": 2
            },
            {
                "body": "they’d take 2 hours to show up and then shoot someone’s dog anyways",
                "author": "strawbansmoo",
                "score": 6
            },
            {
                "body": "Well that’s not very nice",
                "author": "ItssHarrison",
                "score": 3
            },
            {
                "body": "I don’t think he’s actually assaulted anyone or is getting charged with something. I think it’s all being fed to media places to get eyes on him. I mean TMZ is reporting it after all",
                "author": "ItssHarrison",
                "score": -2
            },
            {
                "body": "Clearly he swinging dong.",
                "author": "Poops-iFarted",
                "score": 173
            },
            {
                "body": "A man who was obviously ether on something and high as a kite, was in the middle of having a mental breakdown, or both! Are cops so fucking fragile that three of them wrestling a naked dude to ground is considered assault? Resisting arrest? Sure. But a fee little scrapes and bruises, bullshit. That is part of the job.",
                "author": "zach2beat",
                "score": 236
            },
            {
                "body": "Meth is a hell of a drug",
                "author": "jeeenx",
                "score": 6
            },
            {
                "body": "You should watch more body footage. You'd be surprised how much effort it takes to detain an adult male whose in decent shape and on drugs of any sort if they get violent. Especially because tasers aren't always effective either. \n\nThere's footage of dudes getting shot 15+ times and getting back up to fight with their knife or blunt object strictly just from adrenaline fueled rage. When any kind of drug is involved it's even scarier. Having personally dealt with an armed drugged up individual I'll take the normal angry dude any day of the week because they're far more predictable. \n\nI'd like to see the footage of this encounter, but body armor doesn't do much except protect your chest and back. You're still very exposed elsewhere.  Too many cops have been overwhelmed and beaten or stabbed in the numerous easily accessible places their armor does not cover. We'll know more once footage is out, but yes it's not unheard of for this to happen especially if they're trying not to kill the individual. We shall see if there was any incompetence in handling the incident as well, which is also potentially very likely. Still point stands a fit adult male on drugs or not can be quite difficult to detain if they resist.",
                "author": "gafsstolemysoul",
                "score": 12
            },
            {
                "body": "A naked slim gay man assaulted and injured 3 cops? I want to see proof as well.",
                "author": "Odd_Onion_1591",
                "score": 12
            },
            {
                "body": "Getting beat up by Lil Nas x feels more embarrassing than anything else.",
                "author": "Kashin02",
                "score": 15
            },
            {
                "body": "stop playing with my boy like that. \n\n“IVE BEEN IN THE VALLEY YOU AINT BEEN UP OFF THAT PORCH NAH” \n\nCANT NOBIDY TELL ME NOTHINGGGGGGGGG🗣️🗣️🗣️",
                "author": "Just-Another-User22",
                "score": 1
            },
            {
                "body": "If you give a cop a paper cut, thats assault and injury on a police officer.",
                "author": "Sepof",
                "score": 1
            },
            {
                "body": "I have no idea in this instance, nor am I suggesting anything about it.  However PCP is a hell of a drug and there are plenty of videos showing people’s Godzilla strength when on it.   Including fully naked people (PCP makes people hot and want to take off clothes, but again don’t know if it applies here)",
                "author": "_PROBABLY_CORRECT",
                "score": 1
            },
            {
                "body": "Possible if drugs were involved. My uncle beat up a relevant handful of cops and was tazed 3 times before going down when he was on PCP, granted he had clothes on lol",
                "author": "8T64T7",
                "score": 1
            },
            {
                "body": "Try to restrain a fit adult man (maybe on drugs) that is 6’2 between three persons without anyone getting injured. Also, it never says he “took them out”.",
                "author": "WhispersOfHaru",
                "score": 1
            },
            {
                "body": "Honestly I'm surprised they didn't open fire on him like they love doing to anyone of color....",
                "author": "Solus_Vael",
                "score": 2
            },
            {
                "body": "[removed]",
                "author": "None",
                "score": 1
            },
            {
                "body": "I was mistakenly arrested. They thought I was someone else. Cuffed me and put me in the cruiser. I was chill about it because I knew I'd be good regardless of the inconvenience. I was charged with assault on an officer on top of the other charges. Luckily *one* of the officers cameras was on. That was a quick court day. ",
                "author": "jcamp088",
                "score": 118
            },
            {
                "body": "Maybe sandwiches were thrown. I hear that's a big deal nowadays",
                "author": "GimmieGummies",
                "score": 30
            },
            {
                "body": "Charged him with assault after their fee-fees got hurt.",
                "author": "Ghstfce",
                "score": 46
            },
            {
                "body": "At least he didn't throw a sandwich at them.",
                "author": "SnurgBurglerGrizz",
                "score": 5
            },
            {
                "body": "Well the link shows pics of him walking around naked. That’s not assault but something definitely happened",
                "author": "this_isnt_lemonade",
                "score": 0
            },
            {
                "body": "And im sure when bodycam footage comes out of him kicking the cops as they try to wrestle him in the car, youll turn face and start believing cops, eh?",
                "author": "free__coffee",
                "score": -1
            },
            {
                "body": "This girl I went to high school with was involved in a domestic violence incident with her boyfriend. The police showed up and tackled the guy, wrestling him to the ground. After going through that, this police officer (who was fat and older) died of a heart attack. The boyfriend was charged with murder after the cause of death was ruled to be homicide, despite the manner of death being coronary artery disease. He was given 55 years in prison. \n\nIt was a really interesting story.",
                "author": "Walmartian_Beta",
                "score": 63
            },
            {
                "body": "You just know that asshole got out for a month on medical leave on taxpayers dollars as well for a fucking ripped patch. ACAB.",
                "author": "Kindly-Guidance714",
                "score": 6
            },
            {
                "body": "Yeah ok",
                "author": "ApePositive",
                "score": -10
            },
            {
                "body": "Rodger",
                "author": "Pretend-Patience9581",
                "score": 1
            },
            {
                "body": "Ok.  I only seen the undies one.",
                "author": "Pretend-Patience9581",
                "score": 1
            },
            {
                "body": "Jacking in San Diego, jackyty jackyty jackyty jack",
                "author": "One-Chipmunk2025",
                "score": 7
            },
            {
                "body": "Most developed countries have mental health first responders. It’s not rocket science if you come from a place that doesn’t actively seek to incarcerate minorities for profit.",
                "author": "TheShruteFarmsCEO",
                "score": 14
            },
            {
                "body": "His retelling of the events during one of his stand up specials is hilarious",
                "author": "SithLordScoobyDooku_",
                "score": 5
            },
            {
                "body": "Damn, old school. You brought back memories with that one.",
                "author": "theaviationhistorian",
                "score": 2
            },
            {
                "body": "He wasn’t even naked…",
                "author": "BrushRight",
                "score": 19
            },
            {
                "body": "You forgot *pedophilic, rapist felon! FTFY.",
                "author": "talktotheak47",
                "score": 4
            },
            {
                "body": "realistically, what does this story have anything to do with the idiot currently in charge of our country? \n\ndo we need reminders of him every second of every day?\n\nedit: blocked lmao",
                "author": "Fit-Election6102",
                "score": -1
            },
            {
                "body": "I’m sure they’re gonna take their sweet time with releasing this since it’s a very high-profile case at this point. Not defending them, but if I was about to make national headlines, I’d want everything to be as good as it gets before it goes live. CYA (Cover Your Ass) standard. I have no doubt at least one of them fucked up though.\n\nIt would also be nice to see what their policy and procedures are to have as a reference to the actions they took in the footage. So we could see how much of it is legal, questionable, or otherwise.",
                "author": "GrandmasterHeroin",
                "score": 13
            },
            {
                "body": "I mean, isn’t Lil Nas X’s privacy worth something? I don’t think they should just release the footage to make them look better",
                "author": "the_blessed_unrest",
                "score": 8
            },
            {
                "body": "“Cops have weapons” \n\nYou want them to shoot down unarmed men? \n\nHave you personally dealt with subduing a drug crazied person?",
                "author": "lxlviperlxl",
                "score": 7
            },
            {
                "body": "Are you deranged? His chest muscles were enormous in that video, like borderline steroid-use large. Hell hes a celebrity, most of them, especially ones famous for their physical build, or on some sort of roids",
                "author": "free__coffee",
                "score": 4
            },
            {
                "body": "a body type that he doesn’t have",
                "author": "kotobukiii",
                "score": 1
            },
            {
                "body": "God damn it Napa",
                "author": "PeckerPeeker",
                "score": 3
            },
            {
                "body": "My uncle is a cop here in NZ, and he has said that using a taser on someone on drugs a lot of the time, there's little to no effect. He said that once they went up against someone on meth and after the taser had zero effect, it took 5 cops to restrain him. He and mutiple others all ended up with fuckloads of bruises becaue of it.\n\nA lot of people need to realize how dangerous someone on drugs can be. They are not holding back their strength at all and are paranoid out of their fucking minds.",
                "author": "ChaoticKiwiNZ",
                "score": 5
            },
            {
                "body": "Saw a video once of the guy pulling the barbs out. Drugs are hell of a drug.",
                "author": "QueezyF",
                "score": 6
            },
            {
                "body": "Yeah so that's bs. You've never experienced these kinds of people in your life have you because you'd know how often social workers get injured...",
                "author": "coolchris4200",
                "score": 1
            },
            {
                "body": "Maybe both shouldve been involved? A social worker to try to deescalate the situation and cops for in case the situation turns violent?",
                "author": "boytoyahoy",
                "score": 6
            },
            {
                "body": "Lol, call the social workers. If they get beat up or killed, then call the cops. Copy that. I take it you’re not a social worker?",
                "author": "Gusherslol",
                "score": 2
            },
            {
                "body": "How so?",
                "author": "4sk-Render",
                "score": 2
            },
            {
                "body": "It’s not a stereotype, he’s posted like 50 pictures in his underwear on Instagram lol\n\nAnd calm down, it was supposed to be a joke.",
                "author": "4sk-Render",
                "score": 3
            },
            {
                "body": "Lol, you must live in a shitty area",
                "author": "Ok_Engineer9167",
                "score": -5
            },
            {
                "body": "If TMZ is reporting it you can pretty much guarantee it's true. They're scum, but they're reeeeally fucking good at what they do.",
                "author": "sci_fientist",
                "score": 3
            },
            {
                "body": "The court case and charges are on the county court records website. It’s real.",
                "author": "Kavirell",
                "score": 1
            },
            {
                "body": "Your muscles are actually capable of producing much more force than you normally use. But your nervous system (especially your brain and spinal cord) has built-in “safety limiters” that hold you back, mainly to protect your muscles, tendons, and bones from tearing or breaking.\n\nNot saying the cops are in the right but when you’re on drugs and your brain isn’t functioning properly. There is scenarios where you can exhibit much more strength.",
                "author": "Kuvanet",
                "score": 78
            },
            {
                "body": "You can’t fight cops. Do you think you should be able to?",
                "author": "Prestigious_Ease_625",
                "score": 28
            },
            {
                "body": "Lmao so people drinking abd doing dumb shit should be just forgiven",
                "author": "Shadowban-Trigger",
                "score": 2
            },
            {
                "body": "He’s in there without bond so yeah, pretty fragile.",
                "author": "ShaggysGTI",
                "score": 5
            },
            {
                "body": "One of them probably broke a nail",
                "author": "Venting2theDucks",
                "score": 0
            },
            {
                "body": "Spitting on someone is assualt. You don't need to be in good shape to assualt someone. Also a bruise is an injury",
                "author": "Dapperrevolutionary",
                "score": 15
            },
            {
                "body": "What does sexual preference have to do with this? The latent homophobia lmao",
                "author": "Endante",
                "score": 3
            },
            {
                "body": "I want to see these officers that got injured by a naked Lil Nas X",
                "author": "tinyanus",
                "score": 2
            },
            {
                "body": "Yea, because if he was black they would have… wait…\n\nFucking Redditors",
                "author": "free__coffee",
                "score": -2
            },
            {
                "body": "“Die….thought I was going to die”",
                "author": "imthatguysammy",
                "score": 1
            },
            {
                "body": "How pissed was the judge and how badly did the cops try to play it off until the footage was shown",
                "author": "Ekillaa22",
                "score": 44
            },
            {
                "body": "And you sued back right? Right?",
                "author": "HexxRx",
                "score": 5
            },
            {
                "body": "I'll take things that never happened for 400, Alex.",
                "author": "TallerThanTrees7",
                "score": 1
            },
            {
                "body": "Same as the cop who jumped on Scottie Shefflers car and got his pants ripped.",
                "author": "Baydreams",
                "score": 11
            },
            {
                "body": "Police don’t press charges…",
                "author": "the_blessed_unrest",
                "score": -4
            },
            {
                "body": "Nah, the pigs deserved it anyway. ACAB\n\n\n/s hard",
                "author": "mmlovin",
                "score": 1
            },
            {
                "body": "It’s wild because  cops are found innocent if the person has a preexisting condition… the justice system is wild",
                "author": "Intrepid-Oil-898",
                "score": 43
            },
            {
                "body": "No way",
                "author": "blff266697",
                "score": 2
            },
            {
                "body": "Apparently I \"picked on brass\" as my PO told me. He was newly promoted and had feelings about it.\n\nThe police report had me violently screaming in his face, I was in the back of the cop car and a lady trying to hand me her info they took and tore it up after she left laughing.\n\nI took probation for resisting because duh these fucking courts know. Halfway through me and the lady connected and gave me a written statement with others saying they were willing to testify they threw me in jail on a violation and made sign something saying I wouldn't sue the state or whatever to get out, with the implied \"we'll fuck with you if you don't\" implied.\n\nThen I moved states next to a \"Mormon Wiccan\" with police in the family and then more fuckery happened.\n\nI don't have a high opinion on most of these entities. I understand taking accountability for one's mistakes, but the constant bullshit from courts has broken me a bit.",
                "author": "Butts_Fartington",
                "score": 14
            },
            {
                "body": "I like how the literal only other comment to mine is just another story of cop mo'fuckery and yet you seem to be the way you are",
                "author": "Butts_Fartington",
                "score": 5
            },
            {
                "body": "He is a very funny story teller.",
                "author": "HoraceRadish",
                "score": 4
            },
            {
                "body": "He was!",
                "author": "ctilvolover23",
                "score": 8
            },
            {
                "body": "There was a video that came out with him naked rapping Nicki Minaj’s verse in Monster",
                "author": "allyoop18",
                "score": 1
            },
            {
                "body": "How do you know? The video seems to suggest he is",
                "author": "feedthedogwalkamile",
                "score": -3
            },
            {
                "body": "Realistically, you don't get to control what others joke about to deal with the trauma of having him around. Sorry it was inconvenient for you to be reminded of his existence in that moment.",
                "author": "chamberx2",
                "score": 3
            },
            {
                "body": "Bodycam footage is public in CA because of police brutality. Try actually researching why someone would expect this instead of assuming ill will\n\nIf you're genuinely worried about Lil Nas X's privacy, maybe go ask him what he wants to do instead of assuming. Or maybe complain to TMZ, the company that released the footage that's already out.\n\nAlso, I can see you're all over this thread defending the cops so your concerns that the footage will make Nas X look bad are coming across as disingenuous.\n\n\n\n\nEdit: \n\n\n@mmlovin, you blocked me so that I can't reply. Strange for you to get so so worked up about people caring about police brutality \n\nIt's not like the 45 days is a required holding period. It's the upper limit on how long they're allowed to refuse to allow the public to see the footage. Your explanation about the footage being withheld due to protecting cops against false accusations makes no sense. It does not take 45 days to blur someone's face on a video. The edits could be done in a couple hours. They can release it faster if they have nothing to hide. Holding onto it longer than necessary makes them look sus",
                "author": "Hot_Secretary2665",
                "score": 7
            },
            {
                "body": "Why should I be worried about the privacy of a literal felon and criminal? Just release the Lilnas files already.",
                "author": "Heisenburgo",
                "score": -1
            },
            {
                "body": "They have batons and tasers.",
                "author": "squishmallow2399",
                "score": 1
            },
            {
                "body": "I don’t know why these people just assume you can reason away drugged up paranoia or mental issues like it’s just another Tuesday. \n\nIf the person is a threat, someone who is equipped and capable of handling a threat should respond to minimize as much risk as possible. It’s not a difficult concept",
                "author": "NewImprovedPenguin_R",
                "score": 1
            },
            {
                "body": "That would be ideal tbch",
                "author": "Dapperrevolutionary",
                "score": 3
            },
            {
                "body": "being entertaining in a subreddit called entertainment? unacceptable take his teeth",
                "author": "SpinItUpLockItUp",
                "score": 2
            },
            {
                "body": "Yeah it’s pretty average.",
                "author": "Neither_Cut2973",
                "score": 1
            },
            {
                "body": "Yeah, America.",
                "author": "JohnnyQTruant",
                "score": 1
            },
            {
                "body": "Some people just don’t think crackhead strength is a real thing… I watched a crackhead grab an old hot water tank put it on his back/shoulder then drove off on a bike.",
                "author": "420_69_Fake_Account",
                "score": 91
            },
            {
                "body": "Concur, my uncle beat up several cops and was tazed a few times when on PCP lol",
                "author": "8T64T7",
                "score": 2
            },
            {
                "body": "So that’s why I have all these tears all over, it’s my body going super crackhead strength?",
                "author": "Chaos-Cortex",
                "score": 1
            },
            {
                "body": "Yeah what’s with these replies? Everyone knows if you fight a cop you’re probably going to get charged. Doesn’t matter if you win or lose the fight. \n\nDo people really think there should be no consequences for being naked, drugged up and violent in public?",
                "author": "geoman2k",
                "score": 22
            },
            {
                "body": "Except at the capitol",
                "author": "Cold_Art5051",
                "score": 4
            },
            {
                "body": "Normal cops, no. Most American police?",
                "author": "Giancolaa1",
                "score": -4
            },
            {
                "body": "Also he looks like he’s in amazing shape. Everyone in this thread is being subtly homophobic by thinking it’s funny he can beat up someone.",
                "author": "Sickpup831",
                "score": 4
            },
            {
                "body": "Let’s be honest, he just beat the shit out of 3 cops. That will make his reputation.",
                "author": "Odd_Onion_1591",
                "score": -1
            },
            {
                "body": "Only one of the officers came to court he said something about the view angle. Prosecutor said the state declined to press charges and wouldnt continue the case. The judge actually apologized to me on behalf of the state. \n\nAs I was pulling out the parking lot after I drove by the officer as he was walking to his cruiser Infront on he court. Both just stared at each other and he looks disgruntled. I'm from a small town. He was fired from the police department a few years after for a pretty bad domestic at his house with his then wife and children.",
                "author": "jcamp088",
                "score": 65
            },
            {
                "body": "The judge and the cop are likely friends that call each other by first name and hang out at their kids little league games together. They probably also laugh together about all the lives they’ve ruined by abusing their authority.\n\nAll cops, prosecutors, and judges are bastards.",
                "author": "SwingingtotheBeat",
                "score": -6
            },
            {
                "body": "I did not. Small town it was easier to let it go than deal with future harassment",
                "author": "jcamp088",
                "score": 11
            },
            {
                "body": "There's always one...",
                "author": "Ghstfce",
                "score": 1
            },
            {
                "body": "The justice system is a lie",
                "author": "AENocturne",
                "score": 9
            },
            {
                "body": "Yep, and he got out for some reason, maybe appeals? Anyway after that, he shot his own brother, so he's back in prison.",
                "author": "Walmartian_Beta",
                "score": 2
            },
            {
                "body": "You raise a good point, Butts Fartington.  Without any more evidence, would I assume that the Satan worshiping naked rapper on drugs did something wrong, or the police?",
                "author": "ApePositive",
                "score": -14
            },
            {
                "body": "He’s wearing white underwear and boots. You can see with your own eyes in the video on tmz. Unless he fully disrobed after the video was taken.",
                "author": "BrushRight",
                "score": 20
            },
            {
                "body": "They don’t have to release it for 45 days in California. It is not just to protect the public from police brutality, it’s also to protect law enforcement from false accusations & potential evidence. & privacy matters for all involved. That’s why it just be reviewed before it is released to the public.",
                "author": "mmlovin",
                "score": 7
            },
            {
                "body": "I didn’t block you..idk what happened but I dont see a reply from anyone..\n\n& I was saying what the law is, & the law doesn’t require them to release it up to 45 days. & I explained the reasons why. It’s not just for his privacy, it’s also for the officers’.  & any bystanders. There are more reasons to hold on to footage besides “hiding police brutality.” \n\nIf you think they’re just holding onto it cause they’re hiding something then that’s a you problem. I doubt you will care if you are wrong & it shows him assaulting them.",
                "author": "mmlovin",
                "score": 1
            },
            {
                "body": "this is exactly my point, that the police are *not* capable of handling situations like this with minimum risk, *and that includes minimizing risk to the subject*\n\nnas is now facing years of incarceration because of his interaction with the police, which i have no doubt the police needlessly escalated because they’re trained to see him as a dehumanized criminal and a threat instead of as a person who might be suffering, and in so doing they *make* him into a criminal and a threat. institutional violence is a self-fulfilling prophecy.",
                "author": "phoenixhunter",
                "score": 0
            },
            {
                "body": "Not from what I see lol",
                "author": "4sk-Render",
                "score": 3
            },
            {
                "body": "I saw a crackhead lift up a city bus to pick up a nickel",
                "author": "BatMann1939",
                "score": 52
            },
            {
                "body": "Also gotta give a shoutout to LSD energy. Gives you the strength to run forever.",
                "author": "periodicallyBalzed",
                "score": 14
            },
            {
                "body": "I saw a crackhead take off at a full sprint holding an 80 pound jackhammer on his shoulder",
                "author": "Difficult_Leg_4615",
                "score": 7
            },
            {
                "body": "They think celebs shouldn’t be held accountable",
                "author": "Prestigious_Ease_625",
                "score": 6
            },
            {
                "body": "Lmao. I don’t think that is sustainable. It doesn’t matter if you are famous, stripping down to your undies and fighting a cop will get you jail time, this is common sense.",
                "author": "Prestigious_Ease_625",
                "score": 18
            },
            {
                "body": "Left wing lunatic",
                "author": "OkBumblebee2630",
                "score": -8
            },
            {
                "body": "Ya seriously. Everyone is calling him a twink and saying he can't throw a punch. Like Jesus people",
                "author": "Dapperrevolutionary",
                "score": 3
            },
            {
                "body": "Domestic abuse? From a cop? Wowzers.",
                "author": "BallDesperate2140",
                "score": 35
            },
            {
                "body": "Always one what? Person that corrects you? Well then you shouldn’t say so much incorrect shit",
                "author": "the_blessed_unrest",
                "score": -1
            },
            {
                "body": "Well that was a roller coaster",
                "author": "UrsaUrsuh",
                "score": 3
            },
            {
                "body": "Oh word, you're coming at me with a different context than what my original comment is.",
                "author": "Butts_Fartington",
                "score": 8
            },
            {
                "body": "You missed the other pictures",
                "author": "asifihaventheard",
                "score": 21
            },
            {
                "body": "You are saying these things based on what exactly? You seem to know a lot of facts about this case that hasn’t been made public yet. Maybe you’re right maybe you’re not but let’s call a spade a spade in saying you’re making a lot of baseless assumptions. \n\nPolice are equipped with whatever is needed to stop threats against themselves and other civilians. Someone on drugs can act in a way that you would not even begin to believe. They almost cross into superhuman sometimes. You’re also assuming that all people in these situations respond the same and calm down with some magic sentence. That’s not how it works.\n\nUnpredictability that can turn into a violence spree with the snap of a finger requires a force that can deal with said violence. Not a random innocent social worker who got their job to help people. They don’t deserve that.",
                "author": "NewImprovedPenguin_R",
                "score": 2
            },
            {
                "body": "Tyrone Biggums strikes again",
                "author": "nomatt18",
                "score": 29
            },
            {
                "body": "I saw a crackhead lift up my mom for a skittle",
                "author": "SithLordScoobyDooku_",
                "score": 9
            },
            {
                "body": "Most pull-ups I’ve ever done was on an acid trip (safely at home with friends).\n\nYour body feels so light and your muscles feel so untired.\n\nThen it wears off and it feels like your muscles have been clenched for a full day nonstop.",
                "author": "craznazn247",
                "score": 1
            },
            {
                "body": "I once saw a crackhead pick up my 14 year-old nephew and throw him over a 6-foot fence like a Frisbee",
                "author": "tinyanus",
                "score": 1
            },
            {
                "body": "The irony being he’ll probably be able to afford a good lawyer and most of these charges will probably be dropped or reduced. Something a non-celebrity is less likely to be able to do",
                "author": "geoman2k",
                "score": 6
            },
            {
                "body": "[deleted]",
                "author": "None",
                "score": -1
            },
            {
                "body": "Sane response to a rather light joke about the insanity that is the USA police forces",
                "author": "Giancolaa1",
                "score": 4
            },
            {
                "body": "I'm legitimately surprise he was fired for it.",
                "author": "Oreo_",
                "score": 1
            },
            {
                "body": "My bad got confused!",
                "author": "ApePositive",
                "score": -2
            },
            {
                "body": "😮I sure did",
                "author": "BrushRight",
                "score": 14
            },
            {
                "body": "That was your dad",
                "author": "swift110",
                "score": 7
            },
            {
                "body": "They didn't but his fists did",
                "author": "Dapperrevolutionary",
                "score": 2
            },
            {
                "body": "Oh shit you're good, I'm glad I deleted the minor shit talking ribbing I was adding.",
                "author": "Butts_Fartington",
                "score": 5
            },
            {
                "body": "I was the skittle",
                "author": "Pajo555",
                "score": 5
            },
            {
                "body": "Well, maybe it would’ve been funny so who knows what’s for the best?",
                "author": "ApePositive",
                "score": 0
            },
            {
                "body": "I mean I think it was essentially the same keep thinking that way but then calling me dumb.\n\nI just thought you were saying that story was bullshit because at the time the only other comment was another tale of po po foolishess. And honestly that whole ordeal blew and then I moved states to a condo next to whatever the fuck a \"Mormon Wiccan\" is that had cops in the family and I hate having these stories.\n\nAnd who ever knows right? \n\nTake currrr out durrrrr",
                "author": "Butts_Fartington",
                "score": 1
            }
        ]
    }
]